RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/glb_reg.h
/* 0x50 : bmx_cfg1 */
#define GLB_BMX_CFG1_OFFSET          (0x50)
#define GLB_BMX_TIMEOUT_EN           GLB_BMX_TIMEOUT_EN
#define GLB_BMX_TIMEOUT_EN_POS       (0U)
#define GLB_BMX_TIMEOUT_EN_LEN       (4U)
#define GLB_BMX_TIMEOUT_EN_MSK       (((1U << GLB_BMX_TIMEOUT_EN_LEN) - 1) << GLB_BMX_TIMEOUT_EN_POS)
#define GLB_BMX_TIMEOUT_EN_UMSK      (~(((1U << GLB_BMX_TIMEOUT_EN_LEN) - 1) << GLB_BMX_TIMEOUT_EN_POS))
#define GLB_BMX_ARB_MODE             GLB_BMX_ARB_MODE
#define GLB_BMX_ARB_MODE_POS         (4U)
#define GLB_BMX_ARB_MODE_LEN         (2U)
#define GLB_BMX_ARB_MODE_MSK         (((1U << GLB_BMX_ARB_MODE_LEN) - 1) << GLB_BMX_ARB_MODE_POS)
#define GLB_BMX_ARB_MODE_UMSK        (~(((1U << GLB_BMX_ARB_MODE_LEN) - 1) << GLB_BMX_ARB_MODE_POS))
#define GLB_BMX_ERR_EN               GLB_BMX_ERR_EN
#define GLB_BMX_ERR_EN_POS           (8U)
#define GLB_BMX_ERR_EN_LEN           (1U)
#define GLB_BMX_ERR_EN_MSK           (((1U << GLB_BMX_ERR_EN_LEN) - 1) << GLB_BMX_ERR_EN_POS)
#define GLB_BMX_ERR_EN_UMSK          (~(((1U << GLB_BMX_ERR_EN_LEN) - 1) << GLB_BMX_ERR_EN_POS))
#define GLB_BMX_BUSY_OPTION_DIS      GLB_BMX_BUSY_OPTION_DIS
#define GLB_BMX_BUSY_OPTION_DIS_POS  (9U)
#define GLB_BMX_BUSY_OPTION_DIS_LEN  (1U)
#define GLB_BMX_BUSY_OPTION_DIS_MSK  (((1U << GLB_BMX_BUSY_OPTION_DIS_LEN) - 1) << GLB_BMX_BUSY_OPTION_DIS_POS)
#define GLB_BMX_BUSY_OPTION_DIS_UMSK (~(((1U << GLB_BMX_BUSY_OPTION_DIS_LEN) - 1) << GLB_BMX_BUSY_OPTION_DIS_POS))
#define GLB_BMX_GATING_DIS           GLB_BMX_GATING_DIS
#define GLB_BMX_GATING_DIS_POS       (10U)
#define GLB_BMX_GATING_DIS_LEN       (1U)
#define GLB_BMX_GATING_DIS_MSK       (((1U << GLB_BMX_GATING_DIS_LEN) - 1) << GLB_BMX_GATING_DIS_POS)
#define GLB_BMX_GATING_DIS_UMSK      (~(((1U << GLB_BMX_GATING_DIS_LEN) - 1) << GLB_BMX_GATING_DIS_POS))
#define GLB_HSEL_OPTION              GLB_HSEL_OPTION
#define GLB_HSEL_OPTION_POS          (12U)
#define GLB_HSEL_OPTION_LEN          (4U)
#define GLB_HSEL_OPTION_MSK          (((1U << GLB_HSEL_OPTION_LEN) - 1) << GLB_HSEL_OPTION_POS)
#define GLB_HSEL_OPTION_UMSK         (~(((1U << GLB_HSEL_OPTION_LEN) - 1) << GLB_HSEL_OPTION_POS))
#define GLB_PDS_APB_CFG              GLB_PDS_APB_CFG
#define GLB_PDS_APB_CFG_POS          (16U)
#define GLB_PDS_APB_CFG_LEN          (8U)
#define GLB_PDS_APB_CFG_MSK          (((1U << GLB_PDS_APB_CFG_LEN) - 1) << GLB_PDS_APB_CFG_POS)
#define GLB_PDS_APB_CFG_UMSK         (~(((1U << GLB_PDS_APB_CFG_LEN) - 1) << GLB_PDS_APB_CFG_POS))
#define GLB_HBN_APB_CFG              GLB_HBN_APB_CFG
#define GLB_HBN_APB_CFG_POS          (24U)
#define GLB_HBN_APB_CFG_LEN          (8U)
#define GLB_HBN_APB_CFG_MSK          (((1U << GLB_HBN_APB_CFG_LEN) - 1) << GLB_HBN_APB_CFG_POS)
#define GLB_HBN_APB_CFG_UMSK         (~(((1U << GLB_HBN_APB_CFG_LEN) - 1) << GLB_HBN_APB_CFG_POS))

/* 0x54 : bmx_cfg2 */
#define GLB_BMX_CFG2_OFFSET       (0x54)
#define GLB_BMX_ERR_ADDR_DIS      GLB_BMX_ERR_ADDR_DIS
#define GLB_BMX_ERR_ADDR_DIS_POS  (0U)
#define GLB_BMX_ERR_ADDR_DIS_LEN  (1U)
#define GLB_BMX_ERR_ADDR_DIS_MSK  (((1U << GLB_BMX_ERR_ADDR_DIS_LEN) - 1) << GLB_BMX_ERR_ADDR_DIS_POS)
#define GLB_BMX_ERR_ADDR_DIS_UMSK (~(((1U << GLB_BMX_ERR_ADDR_DIS_LEN) - 1) << GLB_BMX_ERR_ADDR_DIS_POS))
#define GLB_BMX_ERR_DEC           GLB_BMX_ERR_DEC
#define GLB_BMX_ERR_DEC_POS       (4U)
#define GLB_BMX_ERR_DEC_LEN       (1U)
#define GLB_BMX_ERR_DEC_MSK       (((1U << GLB_BMX_ERR_DEC_LEN) - 1) << GLB_BMX_ERR_DEC_POS)
#define GLB_BMX_ERR_DEC_UMSK      (~(((1U << GLB_BMX_ERR_DEC_LEN) - 1) << GLB_BMX_ERR_DEC_POS))
#define GLB_BMX_ERR_TZ            GLB_BMX_ERR_TZ
#define GLB_BMX_ERR_TZ_POS        (5U)
#define GLB_BMX_ERR_TZ_LEN        (1U)
#define GLB_BMX_ERR_TZ_MSK        (((1U << GLB_BMX_ERR_TZ_LEN) - 1) << GLB_BMX_ERR_TZ_POS)
#define GLB_BMX_ERR_TZ_UMSK       (~(((1U << GLB_BMX_ERR_TZ_LEN) - 1) << GLB_BMX_ERR_TZ_POS))
#define GLB_BMX_DBG_SEL           GLB_BMX_DBG_SEL
#define GLB_BMX_DBG_SEL_POS       (28U)
#define GLB_BMX_DBG_SEL_LEN       (4U)
#define GLB_BMX_DBG_SEL_MSK       (((1U << GLB_BMX_DBG_SEL_LEN) - 1) << GLB_BMX_DBG_SEL_POS)
#define GLB_BMX_DBG_SEL_UMSK      (~(((1U << GLB_BMX_DBG_SEL_LEN) - 1) << GLB_BMX_DBG_SEL_POS))

/* 0x58 : bmx_err_addr */
#define GLB_BMX_ERR_ADDR_OFFSET (0x58)
#define GLB_BMX_ERR_ADDR        GLB_BMX_ERR_ADDR
#define GLB_BMX_ERR_ADDR_POS    (0U)
#define GLB_BMX_ERR_ADDR_LEN    (32U)
#define GLB_BMX_ERR_ADDR_MSK    (((1U << GLB_BMX_ERR_ADDR_LEN) - 1) << GLB_BMX_ERR_ADDR_POS)
#define GLB_BMX_ERR_ADDR_UMSK   (~(((1U << GLB_BMX_ERR_ADDR_LEN) - 1) << GLB_BMX_ERR_ADDR_POS))

/* 0x5C : bmx_dbg_out */
#define GLB_BMX_DBG_OUT_OFFSET (0x5C)
#define GLB_BMX_DBG_OUT        GLB_BMX_DBG_OUT
#define GLB_BMX_DBG_OUT_POS    (0U)
#define GLB_BMX_DBG_OUT_LEN    (32U)
#define GLB_BMX_DBG_OUT_MSK    (((1U << GLB_BMX_DBG_OUT_LEN) - 1) << GLB_BMX_DBG_OUT_POS)
#define GLB_BMX_DBG_OUT_UMSK   (~(((1U << GLB_BMX_DBG_OUT_LEN) - 1) << GLB_BMX_DBG_OUT_POS))

/* 0x60 : rsv0 */
#define GLB_RSV0_OFFSET (0x60)

/* 0x64 : rsv1 */
#define GLB_RSV1_OFFSET (0x64)

/* 0x68 : rsv2 */
#define GLB_RSV2_OFFSET (0x68)

/* 0x6C : rsv3 */
#define GLB_RSV3_OFFSET (0x6C)

/* 0x70 : sram_ret */
#define GLB_SRAM_RET_OFFSET   (0x70)
#define GLB_REG_SRAM_RET      GLB_REG_SRAM_RET
#define GLB_REG_SRAM_RET_POS  (0U)
#define GLB_REG_SRAM_RET_LEN  (32U)
#define GLB_REG_SRAM_RET_MSK  (((1U << GLB_REG_SRAM_RET_LEN) - 1) << GLB_REG_SRAM_RET_POS)
#define GLB_REG_SRAM_RET_UMSK (~(((1U << GLB_REG_SRAM_RET_LEN) - 1) << GLB_REG_SRAM_RET_POS))

/* 0x74 : sram_slp */
#define GLB_SRAM_SLP_OFFSET   (0x74)
#define GLB_REG_SRAM_SLP      GLB_REG_SRAM_SLP
#define GLB_REG_SRAM_SLP_POS  (0U)
#define GLB_REG_SRAM_SLP_LEN  (32U)
#define GLB_REG_SRAM_SLP_MSK  (((1U << GLB_REG_SRAM_SLP_LEN) - 1) << GLB_REG_SRAM_SLP_POS)
#define GLB_REG_SRAM_SLP_UMSK (~(((1U << GLB_REG_SRAM_SLP_LEN) - 1) << GLB_REG_SRAM_SLP_POS))

/* 0x78 : sram_parm */
#define GLB_SRAM_PARM_OFFSET   (0x78)
#define GLB_REG_SRAM_PARM      GLB_REG_SRAM_PARM
#define GLB_REG_SRAM_PARM_POS  (0U)
#define GLB_REG_SRAM_PARM_LEN  (32U)
#define GLB_REG_SRAM_PARM_MSK  (((1U << GLB_REG_SRAM_PARM_LEN) - 1) << GLB_REG_SRAM_PARM_POS)
#define GLB_REG_SRAM_PARM_UMSK (~(((1U << GLB_REG_SRAM_PARM_LEN) - 1) << GLB_REG_SRAM_PARM_POS))

