RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/glb_reg.h
/* 0x100 : GPIO_CFGCTL0 */
#define GLB_GPIO_CFGCTL0_OFFSET       (0x100)
#define GLB_REG_GPIO_0_IE             GLB_REG_GPIO_0_IE
#define GLB_REG_GPIO_0_IE_POS         (0U)
#define GLB_REG_GPIO_0_IE_LEN         (1U)
#define GLB_REG_GPIO_0_IE_MSK         (((1U << GLB_REG_GPIO_0_IE_LEN) - 1) << GLB_REG_GPIO_0_IE_POS)
#define GLB_REG_GPIO_0_IE_UMSK        (~(((1U << GLB_REG_GPIO_0_IE_LEN) - 1) << GLB_REG_GPIO_0_IE_POS))
#define GLB_REG_GPIO_0_SMT            GLB_REG_GPIO_0_SMT
#define GLB_REG_GPIO_0_SMT_POS        (1U)
#define GLB_REG_GPIO_0_SMT_LEN        (1U)
#define GLB_REG_GPIO_0_SMT_MSK        (((1U << GLB_REG_GPIO_0_SMT_LEN) - 1) << GLB_REG_GPIO_0_SMT_POS)
#define GLB_REG_GPIO_0_SMT_UMSK       (~(((1U << GLB_REG_GPIO_0_SMT_LEN) - 1) << GLB_REG_GPIO_0_SMT_POS))
#define GLB_REG_GPIO_0_DRV            GLB_REG_GPIO_0_DRV
#define GLB_REG_GPIO_0_DRV_POS        (2U)
#define GLB_REG_GPIO_0_DRV_LEN        (2U)
#define GLB_REG_GPIO_0_DRV_MSK        (((1U << GLB_REG_GPIO_0_DRV_LEN) - 1) << GLB_REG_GPIO_0_DRV_POS)
#define GLB_REG_GPIO_0_DRV_UMSK       (~(((1U << GLB_REG_GPIO_0_DRV_LEN) - 1) << GLB_REG_GPIO_0_DRV_POS))
#define GLB_REG_GPIO_0_PU             GLB_REG_GPIO_0_PU
#define GLB_REG_GPIO_0_PU_POS         (4U)
#define GLB_REG_GPIO_0_PU_LEN         (1U)
#define GLB_REG_GPIO_0_PU_MSK         (((1U << GLB_REG_GPIO_0_PU_LEN) - 1) << GLB_REG_GPIO_0_PU_POS)
#define GLB_REG_GPIO_0_PU_UMSK        (~(((1U << GLB_REG_GPIO_0_PU_LEN) - 1) << GLB_REG_GPIO_0_PU_POS))
#define GLB_REG_GPIO_0_PD             GLB_REG_GPIO_0_PD
#define GLB_REG_GPIO_0_PD_POS         (5U)
#define GLB_REG_GPIO_0_PD_LEN         (1U)
#define GLB_REG_GPIO_0_PD_MSK         (((1U << GLB_REG_GPIO_0_PD_LEN) - 1) << GLB_REG_GPIO_0_PD_POS)
#define GLB_REG_GPIO_0_PD_UMSK        (~(((1U << GLB_REG_GPIO_0_PD_LEN) - 1) << GLB_REG_GPIO_0_PD_POS))
#define GLB_REG_GPIO_0_FUNC_SEL       GLB_REG_GPIO_0_FUNC_SEL
#define GLB_REG_GPIO_0_FUNC_SEL_POS   (8U)
#define GLB_REG_GPIO_0_FUNC_SEL_LEN   (4U)
#define GLB_REG_GPIO_0_FUNC_SEL_MSK   (((1U << GLB_REG_GPIO_0_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_0_FUNC_SEL_POS)
#define GLB_REG_GPIO_0_FUNC_SEL_UMSK  (~(((1U << GLB_REG_GPIO_0_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_0_FUNC_SEL_POS))
#define GLB_REAL_GPIO_0_FUNC_SEL      GLB_REAL_GPIO_0_FUNC_SEL
#define GLB_REAL_GPIO_0_FUNC_SEL_POS  (12U)
#define GLB_REAL_GPIO_0_FUNC_SEL_LEN  (4U)
#define GLB_REAL_GPIO_0_FUNC_SEL_MSK  (((1U << GLB_REAL_GPIO_0_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_0_FUNC_SEL_POS)
#define GLB_REAL_GPIO_0_FUNC_SEL_UMSK (~(((1U << GLB_REAL_GPIO_0_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_0_FUNC_SEL_POS))
#define GLB_REG_GPIO_1_IE             GLB_REG_GPIO_1_IE
#define GLB_REG_GPIO_1_IE_POS         (16U)
#define GLB_REG_GPIO_1_IE_LEN         (1U)
#define GLB_REG_GPIO_1_IE_MSK         (((1U << GLB_REG_GPIO_1_IE_LEN) - 1) << GLB_REG_GPIO_1_IE_POS)
#define GLB_REG_GPIO_1_IE_UMSK        (~(((1U << GLB_REG_GPIO_1_IE_LEN) - 1) << GLB_REG_GPIO_1_IE_POS))
#define GLB_REG_GPIO_1_SMT            GLB_REG_GPIO_1_SMT
#define GLB_REG_GPIO_1_SMT_POS        (17U)
#define GLB_REG_GPIO_1_SMT_LEN        (1U)
#define GLB_REG_GPIO_1_SMT_MSK        (((1U << GLB_REG_GPIO_1_SMT_LEN) - 1) << GLB_REG_GPIO_1_SMT_POS)
#define GLB_REG_GPIO_1_SMT_UMSK       (~(((1U << GLB_REG_GPIO_1_SMT_LEN) - 1) << GLB_REG_GPIO_1_SMT_POS))
#define GLB_REG_GPIO_1_DRV            GLB_REG_GPIO_1_DRV
#define GLB_REG_GPIO_1_DRV_POS        (18U)
#define GLB_REG_GPIO_1_DRV_LEN        (2U)
#define GLB_REG_GPIO_1_DRV_MSK        (((1U << GLB_REG_GPIO_1_DRV_LEN) - 1) << GLB_REG_GPIO_1_DRV_POS)
#define GLB_REG_GPIO_1_DRV_UMSK       (~(((1U << GLB_REG_GPIO_1_DRV_LEN) - 1) << GLB_REG_GPIO_1_DRV_POS))
#define GLB_REG_GPIO_1_PU             GLB_REG_GPIO_1_PU
#define GLB_REG_GPIO_1_PU_POS         (20U)
#define GLB_REG_GPIO_1_PU_LEN         (1U)
#define GLB_REG_GPIO_1_PU_MSK         (((1U << GLB_REG_GPIO_1_PU_LEN) - 1) << GLB_REG_GPIO_1_PU_POS)
#define GLB_REG_GPIO_1_PU_UMSK        (~(((1U << GLB_REG_GPIO_1_PU_LEN) - 1) << GLB_REG_GPIO_1_PU_POS))
#define GLB_REG_GPIO_1_PD             GLB_REG_GPIO_1_PD
#define GLB_REG_GPIO_1_PD_POS         (21U)
#define GLB_REG_GPIO_1_PD_LEN         (1U)
#define GLB_REG_GPIO_1_PD_MSK         (((1U << GLB_REG_GPIO_1_PD_LEN) - 1) << GLB_REG_GPIO_1_PD_POS)
#define GLB_REG_GPIO_1_PD_UMSK        (~(((1U << GLB_REG_GPIO_1_PD_LEN) - 1) << GLB_REG_GPIO_1_PD_POS))
#define GLB_REG_GPIO_1_FUNC_SEL       GLB_REG_GPIO_1_FUNC_SEL
#define GLB_REG_GPIO_1_FUNC_SEL_POS   (24U)
#define GLB_REG_GPIO_1_FUNC_SEL_LEN   (4U)
#define GLB_REG_GPIO_1_FUNC_SEL_MSK   (((1U << GLB_REG_GPIO_1_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_1_FUNC_SEL_POS)
#define GLB_REG_GPIO_1_FUNC_SEL_UMSK  (~(((1U << GLB_REG_GPIO_1_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_1_FUNC_SEL_POS))
#define GLB_REAL_GPIO_1_FUNC_SEL      GLB_REAL_GPIO_1_FUNC_SEL
#define GLB_REAL_GPIO_1_FUNC_SEL_POS  (28U)
#define GLB_REAL_GPIO_1_FUNC_SEL_LEN  (4U)
#define GLB_REAL_GPIO_1_FUNC_SEL_MSK  (((1U << GLB_REAL_GPIO_1_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_1_FUNC_SEL_POS)
#define GLB_REAL_GPIO_1_FUNC_SEL_UMSK (~(((1U << GLB_REAL_GPIO_1_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_1_FUNC_SEL_POS))

/* 0x104 : GPIO_CFGCTL1 */
#define GLB_GPIO_CFGCTL1_OFFSET       (0x104)
#define GLB_REG_GPIO_2_IE             GLB_REG_GPIO_2_IE
#define GLB_REG_GPIO_2_IE_POS         (0U)
#define GLB_REG_GPIO_2_IE_LEN         (1U)
#define GLB_REG_GPIO_2_IE_MSK         (((1U << GLB_REG_GPIO_2_IE_LEN) - 1) << GLB_REG_GPIO_2_IE_POS)
#define GLB_REG_GPIO_2_IE_UMSK        (~(((1U << GLB_REG_GPIO_2_IE_LEN) - 1) << GLB_REG_GPIO_2_IE_POS))
#define GLB_REG_GPIO_2_SMT            GLB_REG_GPIO_2_SMT
#define GLB_REG_GPIO_2_SMT_POS        (1U)
#define GLB_REG_GPIO_2_SMT_LEN        (1U)
#define GLB_REG_GPIO_2_SMT_MSK        (((1U << GLB_REG_GPIO_2_SMT_LEN) - 1) << GLB_REG_GPIO_2_SMT_POS)
#define GLB_REG_GPIO_2_SMT_UMSK       (~(((1U << GLB_REG_GPIO_2_SMT_LEN) - 1) << GLB_REG_GPIO_2_SMT_POS))
#define GLB_REG_GPIO_2_DRV            GLB_REG_GPIO_2_DRV
#define GLB_REG_GPIO_2_DRV_POS        (2U)
#define GLB_REG_GPIO_2_DRV_LEN        (2U)
#define GLB_REG_GPIO_2_DRV_MSK        (((1U << GLB_REG_GPIO_2_DRV_LEN) - 1) << GLB_REG_GPIO_2_DRV_POS)
#define GLB_REG_GPIO_2_DRV_UMSK       (~(((1U << GLB_REG_GPIO_2_DRV_LEN) - 1) << GLB_REG_GPIO_2_DRV_POS))
#define GLB_REG_GPIO_2_PU             GLB_REG_GPIO_2_PU
#define GLB_REG_GPIO_2_PU_POS         (4U)
#define GLB_REG_GPIO_2_PU_LEN         (1U)
#define GLB_REG_GPIO_2_PU_MSK         (((1U << GLB_REG_GPIO_2_PU_LEN) - 1) << GLB_REG_GPIO_2_PU_POS)
#define GLB_REG_GPIO_2_PU_UMSK        (~(((1U << GLB_REG_GPIO_2_PU_LEN) - 1) << GLB_REG_GPIO_2_PU_POS))
#define GLB_REG_GPIO_2_PD             GLB_REG_GPIO_2_PD
#define GLB_REG_GPIO_2_PD_POS         (5U)
#define GLB_REG_GPIO_2_PD_LEN         (1U)
#define GLB_REG_GPIO_2_PD_MSK         (((1U << GLB_REG_GPIO_2_PD_LEN) - 1) << GLB_REG_GPIO_2_PD_POS)
#define GLB_REG_GPIO_2_PD_UMSK        (~(((1U << GLB_REG_GPIO_2_PD_LEN) - 1) << GLB_REG_GPIO_2_PD_POS))
#define GLB_REG_GPIO_2_FUNC_SEL       GLB_REG_GPIO_2_FUNC_SEL
#define GLB_REG_GPIO_2_FUNC_SEL_POS   (8U)
#define GLB_REG_GPIO_2_FUNC_SEL_LEN   (4U)
#define GLB_REG_GPIO_2_FUNC_SEL_MSK   (((1U << GLB_REG_GPIO_2_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_2_FUNC_SEL_POS)
#define GLB_REG_GPIO_2_FUNC_SEL_UMSK  (~(((1U << GLB_REG_GPIO_2_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_2_FUNC_SEL_POS))
#define GLB_REAL_GPIO_2_FUNC_SEL      GLB_REAL_GPIO_2_FUNC_SEL
#define GLB_REAL_GPIO_2_FUNC_SEL_POS  (12U)
#define GLB_REAL_GPIO_2_FUNC_SEL_LEN  (4U)
#define GLB_REAL_GPIO_2_FUNC_SEL_MSK  (((1U << GLB_REAL_GPIO_2_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_2_FUNC_SEL_POS)
#define GLB_REAL_GPIO_2_FUNC_SEL_UMSK (~(((1U << GLB_REAL_GPIO_2_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_2_FUNC_SEL_POS))
#define GLB_REG_GPIO_3_IE             GLB_REG_GPIO_3_IE
#define GLB_REG_GPIO_3_IE_POS         (16U)
#define GLB_REG_GPIO_3_IE_LEN         (1U)
#define GLB_REG_GPIO_3_IE_MSK         (((1U << GLB_REG_GPIO_3_IE_LEN) - 1) << GLB_REG_GPIO_3_IE_POS)
#define GLB_REG_GPIO_3_IE_UMSK        (~(((1U << GLB_REG_GPIO_3_IE_LEN) - 1) << GLB_REG_GPIO_3_IE_POS))
#define GLB_REG_GPIO_3_SMT            GLB_REG_GPIO_3_SMT
#define GLB_REG_GPIO_3_SMT_POS        (17U)
#define GLB_REG_GPIO_3_SMT_LEN        (1U)
#define GLB_REG_GPIO_3_SMT_MSK        (((1U << GLB_REG_GPIO_3_SMT_LEN) - 1) << GLB_REG_GPIO_3_SMT_POS)
#define GLB_REG_GPIO_3_SMT_UMSK       (~(((1U << GLB_REG_GPIO_3_SMT_LEN) - 1) << GLB_REG_GPIO_3_SMT_POS))
#define GLB_REG_GPIO_3_DRV            GLB_REG_GPIO_3_DRV
#define GLB_REG_GPIO_3_DRV_POS        (18U)
#define GLB_REG_GPIO_3_DRV_LEN        (2U)
#define GLB_REG_GPIO_3_DRV_MSK        (((1U << GLB_REG_GPIO_3_DRV_LEN) - 1) << GLB_REG_GPIO_3_DRV_POS)
#define GLB_REG_GPIO_3_DRV_UMSK       (~(((1U << GLB_REG_GPIO_3_DRV_LEN) - 1) << GLB_REG_GPIO_3_DRV_POS))
#define GLB_REG_GPIO_3_PU             GLB_REG_GPIO_3_PU
#define GLB_REG_GPIO_3_PU_POS         (20U)
#define GLB_REG_GPIO_3_PU_LEN         (1U)
#define GLB_REG_GPIO_3_PU_MSK         (((1U << GLB_REG_GPIO_3_PU_LEN) - 1) << GLB_REG_GPIO_3_PU_POS)
#define GLB_REG_GPIO_3_PU_UMSK        (~(((1U << GLB_REG_GPIO_3_PU_LEN) - 1) << GLB_REG_GPIO_3_PU_POS))
#define GLB_REG_GPIO_3_PD             GLB_REG_GPIO_3_PD
#define GLB_REG_GPIO_3_PD_POS         (21U)
#define GLB_REG_GPIO_3_PD_LEN         (1U)
#define GLB_REG_GPIO_3_PD_MSK         (((1U << GLB_REG_GPIO_3_PD_LEN) - 1) << GLB_REG_GPIO_3_PD_POS)
#define GLB_REG_GPIO_3_PD_UMSK        (~(((1U << GLB_REG_GPIO_3_PD_LEN) - 1) << GLB_REG_GPIO_3_PD_POS))
#define GLB_REG_GPIO_3_FUNC_SEL       GLB_REG_GPIO_3_FUNC_SEL
#define GLB_REG_GPIO_3_FUNC_SEL_POS   (24U)
#define GLB_REG_GPIO_3_FUNC_SEL_LEN   (4U)
#define GLB_REG_GPIO_3_FUNC_SEL_MSK   (((1U << GLB_REG_GPIO_3_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_3_FUNC_SEL_POS)
#define GLB_REG_GPIO_3_FUNC_SEL_UMSK  (~(((1U << GLB_REG_GPIO_3_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_3_FUNC_SEL_POS))
#define GLB_REAL_GPIO_3_FUNC_SEL      GLB_REAL_GPIO_3_FUNC_SEL
#define GLB_REAL_GPIO_3_FUNC_SEL_POS  (28U)
#define GLB_REAL_GPIO_3_FUNC_SEL_LEN  (4U)
#define GLB_REAL_GPIO_3_FUNC_SEL_MSK  (((1U << GLB_REAL_GPIO_3_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_3_FUNC_SEL_POS)
#define GLB_REAL_GPIO_3_FUNC_SEL_UMSK (~(((1U << GLB_REAL_GPIO_3_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_3_FUNC_SEL_POS))

/* 0x108 : GPIO_CFGCTL2 */
#define GLB_GPIO_CFGCTL2_OFFSET       (0x108)
#define GLB_REG_GPIO_4_IE             GLB_REG_GPIO_4_IE
#define GLB_REG_GPIO_4_IE_POS         (0U)
#define GLB_REG_GPIO_4_IE_LEN         (1U)
#define GLB_REG_GPIO_4_IE_MSK         (((1U << GLB_REG_GPIO_4_IE_LEN) - 1) << GLB_REG_GPIO_4_IE_POS)
#define GLB_REG_GPIO_4_IE_UMSK        (~(((1U << GLB_REG_GPIO_4_IE_LEN) - 1) << GLB_REG_GPIO_4_IE_POS))
#define GLB_REG_GPIO_4_SMT            GLB_REG_GPIO_4_SMT
#define GLB_REG_GPIO_4_SMT_POS        (1U)
#define GLB_REG_GPIO_4_SMT_LEN        (1U)
#define GLB_REG_GPIO_4_SMT_MSK        (((1U << GLB_REG_GPIO_4_SMT_LEN) - 1) << GLB_REG_GPIO_4_SMT_POS)
#define GLB_REG_GPIO_4_SMT_UMSK       (~(((1U << GLB_REG_GPIO_4_SMT_LEN) - 1) << GLB_REG_GPIO_4_SMT_POS))
#define GLB_REG_GPIO_4_DRV            GLB_REG_GPIO_4_DRV
#define GLB_REG_GPIO_4_DRV_POS        (2U)
#define GLB_REG_GPIO_4_DRV_LEN        (2U)
#define GLB_REG_GPIO_4_DRV_MSK        (((1U << GLB_REG_GPIO_4_DRV_LEN) - 1) << GLB_REG_GPIO_4_DRV_POS)
#define GLB_REG_GPIO_4_DRV_UMSK       (~(((1U << GLB_REG_GPIO_4_DRV_LEN) - 1) << GLB_REG_GPIO_4_DRV_POS))
#define GLB_REG_GPIO_4_PU             GLB_REG_GPIO_4_PU
#define GLB_REG_GPIO_4_PU_POS         (4U)
#define GLB_REG_GPIO_4_PU_LEN         (1U)
#define GLB_REG_GPIO_4_PU_MSK         (((1U << GLB_REG_GPIO_4_PU_LEN) - 1) << GLB_REG_GPIO_4_PU_POS)
#define GLB_REG_GPIO_4_PU_UMSK        (~(((1U << GLB_REG_GPIO_4_PU_LEN) - 1) << GLB_REG_GPIO_4_PU_POS))
#define GLB_REG_GPIO_4_PD             GLB_REG_GPIO_4_PD
#define GLB_REG_GPIO_4_PD_POS         (5U)
#define GLB_REG_GPIO_4_PD_LEN         (1U)
#define GLB_REG_GPIO_4_PD_MSK         (((1U << GLB_REG_GPIO_4_PD_LEN) - 1) << GLB_REG_GPIO_4_PD_POS)
#define GLB_REG_GPIO_4_PD_UMSK        (~(((1U << GLB_REG_GPIO_4_PD_LEN) - 1) << GLB_REG_GPIO_4_PD_POS))
#define GLB_REG_GPIO_4_FUNC_SEL       GLB_REG_GPIO_4_FUNC_SEL
#define GLB_REG_GPIO_4_FUNC_SEL_POS   (8U)
#define GLB_REG_GPIO_4_FUNC_SEL_LEN   (4U)
#define GLB_REG_GPIO_4_FUNC_SEL_MSK   (((1U << GLB_REG_GPIO_4_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_4_FUNC_SEL_POS)
#define GLB_REG_GPIO_4_FUNC_SEL_UMSK  (~(((1U << GLB_REG_GPIO_4_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_4_FUNC_SEL_POS))
#define GLB_REAL_GPIO_4_FUNC_SEL      GLB_REAL_GPIO_4_FUNC_SEL
#define GLB_REAL_GPIO_4_FUNC_SEL_POS  (12U)
#define GLB_REAL_GPIO_4_FUNC_SEL_LEN  (4U)
#define GLB_REAL_GPIO_4_FUNC_SEL_MSK  (((1U << GLB_REAL_GPIO_4_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_4_FUNC_SEL_POS)
#define GLB_REAL_GPIO_4_FUNC_SEL_UMSK (~(((1U << GLB_REAL_GPIO_4_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_4_FUNC_SEL_POS))
#define GLB_REG_GPIO_5_IE             GLB_REG_GPIO_5_IE
#define GLB_REG_GPIO_5_IE_POS         (16U)
#define GLB_REG_GPIO_5_IE_LEN         (1U)
#define GLB_REG_GPIO_5_IE_MSK         (((1U << GLB_REG_GPIO_5_IE_LEN) - 1) << GLB_REG_GPIO_5_IE_POS)
#define GLB_REG_GPIO_5_IE_UMSK        (~(((1U << GLB_REG_GPIO_5_IE_LEN) - 1) << GLB_REG_GPIO_5_IE_POS))
#define GLB_REG_GPIO_5_SMT            GLB_REG_GPIO_5_SMT
#define GLB_REG_GPIO_5_SMT_POS        (17U)
#define GLB_REG_GPIO_5_SMT_LEN        (1U)
#define GLB_REG_GPIO_5_SMT_MSK        (((1U << GLB_REG_GPIO_5_SMT_LEN) - 1) << GLB_REG_GPIO_5_SMT_POS)
#define GLB_REG_GPIO_5_SMT_UMSK       (~(((1U << GLB_REG_GPIO_5_SMT_LEN) - 1) << GLB_REG_GPIO_5_SMT_POS))
#define GLB_REG_GPIO_5_DRV            GLB_REG_GPIO_5_DRV
#define GLB_REG_GPIO_5_DRV_POS        (18U)
#define GLB_REG_GPIO_5_DRV_LEN        (2U)
#define GLB_REG_GPIO_5_DRV_MSK        (((1U << GLB_REG_GPIO_5_DRV_LEN) - 1) << GLB_REG_GPIO_5_DRV_POS)
#define GLB_REG_GPIO_5_DRV_UMSK       (~(((1U << GLB_REG_GPIO_5_DRV_LEN) - 1) << GLB_REG_GPIO_5_DRV_POS))
#define GLB_REG_GPIO_5_PU             GLB_REG_GPIO_5_PU
#define GLB_REG_GPIO_5_PU_POS         (20U)
#define GLB_REG_GPIO_5_PU_LEN         (1U)
#define GLB_REG_GPIO_5_PU_MSK         (((1U << GLB_REG_GPIO_5_PU_LEN) - 1) << GLB_REG_GPIO_5_PU_POS)
#define GLB_REG_GPIO_5_PU_UMSK        (~(((1U << GLB_REG_GPIO_5_PU_LEN) - 1) << GLB_REG_GPIO_5_PU_POS))
#define GLB_REG_GPIO_5_PD             GLB_REG_GPIO_5_PD
#define GLB_REG_GPIO_5_PD_POS         (21U)
#define GLB_REG_GPIO_5_PD_LEN         (1U)
#define GLB_REG_GPIO_5_PD_MSK         (((1U << GLB_REG_GPIO_5_PD_LEN) - 1) << GLB_REG_GPIO_5_PD_POS)
#define GLB_REG_GPIO_5_PD_UMSK        (~(((1U << GLB_REG_GPIO_5_PD_LEN) - 1) << GLB_REG_GPIO_5_PD_POS))
#define GLB_REG_GPIO_5_FUNC_SEL       GLB_REG_GPIO_5_FUNC_SEL
#define GLB_REG_GPIO_5_FUNC_SEL_POS   (24U)
#define GLB_REG_GPIO_5_FUNC_SEL_LEN   (4U)
#define GLB_REG_GPIO_5_FUNC_SEL_MSK   (((1U << GLB_REG_GPIO_5_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_5_FUNC_SEL_POS)
#define GLB_REG_GPIO_5_FUNC_SEL_UMSK  (~(((1U << GLB_REG_GPIO_5_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_5_FUNC_SEL_POS))
#define GLB_REAL_GPIO_5_FUNC_SEL      GLB_REAL_GPIO_5_FUNC_SEL
#define GLB_REAL_GPIO_5_FUNC_SEL_POS  (28U)
#define GLB_REAL_GPIO_5_FUNC_SEL_LEN  (4U)
#define GLB_REAL_GPIO_5_FUNC_SEL_MSK  (((1U << GLB_REAL_GPIO_5_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_5_FUNC_SEL_POS)
#define GLB_REAL_GPIO_5_FUNC_SEL_UMSK (~(((1U << GLB_REAL_GPIO_5_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_5_FUNC_SEL_POS))

/* 0x10C : GPIO_CFGCTL3 */
#define GLB_GPIO_CFGCTL3_OFFSET      (0x10C)
#define GLB_REG_GPIO_6_IE            GLB_REG_GPIO_6_IE
#define GLB_REG_GPIO_6_IE_POS        (0U)
#define GLB_REG_GPIO_6_IE_LEN        (1U)
#define GLB_REG_GPIO_6_IE_MSK        (((1U << GLB_REG_GPIO_6_IE_LEN) - 1) << GLB_REG_GPIO_6_IE_POS)
#define GLB_REG_GPIO_6_IE_UMSK       (~(((1U << GLB_REG_GPIO_6_IE_LEN) - 1) << GLB_REG_GPIO_6_IE_POS))
#define GLB_REG_GPIO_6_SMT           GLB_REG_GPIO_6_SMT
#define GLB_REG_GPIO_6_SMT_POS       (1U)
#define GLB_REG_GPIO_6_SMT_LEN       (1U)
#define GLB_REG_GPIO_6_SMT_MSK       (((1U << GLB_REG_GPIO_6_SMT_LEN) - 1) << GLB_REG_GPIO_6_SMT_POS)
#define GLB_REG_GPIO_6_SMT_UMSK      (~(((1U << GLB_REG_GPIO_6_SMT_LEN) - 1) << GLB_REG_GPIO_6_SMT_POS))
#define GLB_REG_GPIO_6_DRV           GLB_REG_GPIO_6_DRV
#define GLB_REG_GPIO_6_DRV_POS       (2U)
#define GLB_REG_GPIO_6_DRV_LEN       (2U)
#define GLB_REG_GPIO_6_DRV_MSK       (((1U << GLB_REG_GPIO_6_DRV_LEN) - 1) << GLB_REG_GPIO_6_DRV_POS)
#define GLB_REG_GPIO_6_DRV_UMSK      (~(((1U << GLB_REG_GPIO_6_DRV_LEN) - 1) << GLB_REG_GPIO_6_DRV_POS))
#define GLB_REG_GPIO_6_PU            GLB_REG_GPIO_6_PU
#define GLB_REG_GPIO_6_PU_POS        (4U)
#define GLB_REG_GPIO_6_PU_LEN        (1U)
#define GLB_REG_GPIO_6_PU_MSK        (((1U << GLB_REG_GPIO_6_PU_LEN) - 1) << GLB_REG_GPIO_6_PU_POS)
#define GLB_REG_GPIO_6_PU_UMSK       (~(((1U << GLB_REG_GPIO_6_PU_LEN) - 1) << GLB_REG_GPIO_6_PU_POS))
#define GLB_REG_GPIO_6_PD            GLB_REG_GPIO_6_PD
#define GLB_REG_GPIO_6_PD_POS        (5U)
#define GLB_REG_GPIO_6_PD_LEN        (1U)
#define GLB_REG_GPIO_6_PD_MSK        (((1U << GLB_REG_GPIO_6_PD_LEN) - 1) << GLB_REG_GPIO_6_PD_POS)
#define GLB_REG_GPIO_6_PD_UMSK       (~(((1U << GLB_REG_GPIO_6_PD_LEN) - 1) << GLB_REG_GPIO_6_PD_POS))
#define GLB_REG_GPIO_6_FUNC_SEL      GLB_REG_GPIO_6_FUNC_SEL
#define GLB_REG_GPIO_6_FUNC_SEL_POS  (8U)
#define GLB_REG_GPIO_6_FUNC_SEL_LEN  (4U)
#define GLB_REG_GPIO_6_FUNC_SEL_MSK  (((1U << GLB_REG_GPIO_6_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_6_FUNC_SEL_POS)
#define GLB_REG_GPIO_6_FUNC_SEL_UMSK (~(((1U << GLB_REG_GPIO_6_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_6_FUNC_SEL_POS))
#define GLB_REG_GPIO_7_IE            GLB_REG_GPIO_7_IE
#define GLB_REG_GPIO_7_IE_POS        (16U)
#define GLB_REG_GPIO_7_IE_LEN        (1U)
#define GLB_REG_GPIO_7_IE_MSK        (((1U << GLB_REG_GPIO_7_IE_LEN) - 1) << GLB_REG_GPIO_7_IE_POS)
#define GLB_REG_GPIO_7_IE_UMSK       (~(((1U << GLB_REG_GPIO_7_IE_LEN) - 1) << GLB_REG_GPIO_7_IE_POS))
#define GLB_REG_GPIO_7_SMT           GLB_REG_GPIO_7_SMT
#define GLB_REG_GPIO_7_SMT_POS       (17U)
#define GLB_REG_GPIO_7_SMT_LEN       (1U)
#define GLB_REG_GPIO_7_SMT_MSK       (((1U << GLB_REG_GPIO_7_SMT_LEN) - 1) << GLB_REG_GPIO_7_SMT_POS)
#define GLB_REG_GPIO_7_SMT_UMSK      (~(((1U << GLB_REG_GPIO_7_SMT_LEN) - 1) << GLB_REG_GPIO_7_SMT_POS))
#define GLB_REG_GPIO_7_DRV           GLB_REG_GPIO_7_DRV
#define GLB_REG_GPIO_7_DRV_POS       (18U)
#define GLB_REG_GPIO_7_DRV_LEN       (2U)
#define GLB_REG_GPIO_7_DRV_MSK       (((1U << GLB_REG_GPIO_7_DRV_LEN) - 1) << GLB_REG_GPIO_7_DRV_POS)
#define GLB_REG_GPIO_7_DRV_UMSK      (~(((1U << GLB_REG_GPIO_7_DRV_LEN) - 1) << GLB_REG_GPIO_7_DRV_POS))
#define GLB_REG_GPIO_7_PU            GLB_REG_GPIO_7_PU
#define GLB_REG_GPIO_7_PU_POS        (20U)
#define GLB_REG_GPIO_7_PU_LEN        (1U)
#define GLB_REG_GPIO_7_PU_MSK        (((1U << GLB_REG_GPIO_7_PU_LEN) - 1) << GLB_REG_GPIO_7_PU_POS)
#define GLB_REG_GPIO_7_PU_UMSK       (~(((1U << GLB_REG_GPIO_7_PU_LEN) - 1) << GLB_REG_GPIO_7_PU_POS))
#define GLB_REG_GPIO_7_PD            GLB_REG_GPIO_7_PD
#define GLB_REG_GPIO_7_PD_POS        (21U)
#define GLB_REG_GPIO_7_PD_LEN        (1U)
#define GLB_REG_GPIO_7_PD_MSK        (((1U << GLB_REG_GPIO_7_PD_LEN) - 1) << GLB_REG_GPIO_7_PD_POS)
#define GLB_REG_GPIO_7_PD_UMSK       (~(((1U << GLB_REG_GPIO_7_PD_LEN) - 1) << GLB_REG_GPIO_7_PD_POS))
#define GLB_REG_GPIO_7_FUNC_SEL      GLB_REG_GPIO_7_FUNC_SEL
#define GLB_REG_GPIO_7_FUNC_SEL_POS  (24U)
#define GLB_REG_GPIO_7_FUNC_SEL_LEN  (4U)
#define GLB_REG_GPIO_7_FUNC_SEL_MSK  (((1U << GLB_REG_GPIO_7_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_7_FUNC_SEL_POS)
#define GLB_REG_GPIO_7_FUNC_SEL_UMSK (~(((1U << GLB_REG_GPIO_7_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_7_FUNC_SEL_POS))

/* 0x110 : GPIO_CFGCTL4 */
#define GLB_GPIO_CFGCTL4_OFFSET      (0x110)
#define GLB_REG_GPIO_8_IE            GLB_REG_GPIO_8_IE
#define GLB_REG_GPIO_8_IE_POS        (0U)
#define GLB_REG_GPIO_8_IE_LEN        (1U)
#define GLB_REG_GPIO_8_IE_MSK        (((1U << GLB_REG_GPIO_8_IE_LEN) - 1) << GLB_REG_GPIO_8_IE_POS)
#define GLB_REG_GPIO_8_IE_UMSK       (~(((1U << GLB_REG_GPIO_8_IE_LEN) - 1) << GLB_REG_GPIO_8_IE_POS))
#define GLB_REG_GPIO_8_SMT           GLB_REG_GPIO_8_SMT
#define GLB_REG_GPIO_8_SMT_POS       (1U)
#define GLB_REG_GPIO_8_SMT_LEN       (1U)
#define GLB_REG_GPIO_8_SMT_MSK       (((1U << GLB_REG_GPIO_8_SMT_LEN) - 1) << GLB_REG_GPIO_8_SMT_POS)
#define GLB_REG_GPIO_8_SMT_UMSK      (~(((1U << GLB_REG_GPIO_8_SMT_LEN) - 1) << GLB_REG_GPIO_8_SMT_POS))
#define GLB_REG_GPIO_8_DRV           GLB_REG_GPIO_8_DRV
#define GLB_REG_GPIO_8_DRV_POS       (2U)
#define GLB_REG_GPIO_8_DRV_LEN       (2U)
#define GLB_REG_GPIO_8_DRV_MSK       (((1U << GLB_REG_GPIO_8_DRV_LEN) - 1) << GLB_REG_GPIO_8_DRV_POS)
#define GLB_REG_GPIO_8_DRV_UMSK      (~(((1U << GLB_REG_GPIO_8_DRV_LEN) - 1) << GLB_REG_GPIO_8_DRV_POS))
#define GLB_REG_GPIO_8_PU            GLB_REG_GPIO_8_PU
#define GLB_REG_GPIO_8_PU_POS        (4U)
#define GLB_REG_GPIO_8_PU_LEN        (1U)
#define GLB_REG_GPIO_8_PU_MSK        (((1U << GLB_REG_GPIO_8_PU_LEN) - 1) << GLB_REG_GPIO_8_PU_POS)
#define GLB_REG_GPIO_8_PU_UMSK       (~(((1U << GLB_REG_GPIO_8_PU_LEN) - 1) << GLB_REG_GPIO_8_PU_POS))
#define GLB_REG_GPIO_8_PD            GLB_REG_GPIO_8_PD
#define GLB_REG_GPIO_8_PD_POS        (5U)
#define GLB_REG_GPIO_8_PD_LEN        (1U)
#define GLB_REG_GPIO_8_PD_MSK        (((1U << GLB_REG_GPIO_8_PD_LEN) - 1) << GLB_REG_GPIO_8_PD_POS)
#define GLB_REG_GPIO_8_PD_UMSK       (~(((1U << GLB_REG_GPIO_8_PD_LEN) - 1) << GLB_REG_GPIO_8_PD_POS))
#define GLB_REG_GPIO_8_FUNC_SEL      GLB_REG_GPIO_8_FUNC_SEL
#define GLB_REG_GPIO_8_FUNC_SEL_POS  (8U)
#define GLB_REG_GPIO_8_FUNC_SEL_LEN  (4U)
#define GLB_REG_GPIO_8_FUNC_SEL_MSK  (((1U << GLB_REG_GPIO_8_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_8_FUNC_SEL_POS)
#define GLB_REG_GPIO_8_FUNC_SEL_UMSK (~(((1U << GLB_REG_GPIO_8_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_8_FUNC_SEL_POS))
#define GLB_REG_GPIO_9_IE            GLB_REG_GPIO_9_IE
#define GLB_REG_GPIO_9_IE_POS        (16U)
#define GLB_REG_GPIO_9_IE_LEN        (1U)
#define GLB_REG_GPIO_9_IE_MSK        (((1U << GLB_REG_GPIO_9_IE_LEN) - 1) << GLB_REG_GPIO_9_IE_POS)
#define GLB_REG_GPIO_9_IE_UMSK       (~(((1U << GLB_REG_GPIO_9_IE_LEN) - 1) << GLB_REG_GPIO_9_IE_POS))
#define GLB_REG_GPIO_9_SMT           GLB_REG_GPIO_9_SMT
#define GLB_REG_GPIO_9_SMT_POS       (17U)
#define GLB_REG_GPIO_9_SMT_LEN       (1U)
#define GLB_REG_GPIO_9_SMT_MSK       (((1U << GLB_REG_GPIO_9_SMT_LEN) - 1) << GLB_REG_GPIO_9_SMT_POS)
#define GLB_REG_GPIO_9_SMT_UMSK      (~(((1U << GLB_REG_GPIO_9_SMT_LEN) - 1) << GLB_REG_GPIO_9_SMT_POS))
#define GLB_REG_GPIO_9_DRV           GLB_REG_GPIO_9_DRV
#define GLB_REG_GPIO_9_DRV_POS       (18U)
#define GLB_REG_GPIO_9_DRV_LEN       (2U)
#define GLB_REG_GPIO_9_DRV_MSK       (((1U << GLB_REG_GPIO_9_DRV_LEN) - 1) << GLB_REG_GPIO_9_DRV_POS)
#define GLB_REG_GPIO_9_DRV_UMSK      (~(((1U << GLB_REG_GPIO_9_DRV_LEN) - 1) << GLB_REG_GPIO_9_DRV_POS))
#define GLB_REG_GPIO_9_PU            GLB_REG_GPIO_9_PU
#define GLB_REG_GPIO_9_PU_POS        (20U)
#define GLB_REG_GPIO_9_PU_LEN        (1U)
#define GLB_REG_GPIO_9_PU_MSK        (((1U << GLB_REG_GPIO_9_PU_LEN) - 1) << GLB_REG_GPIO_9_PU_POS)
#define GLB_REG_GPIO_9_PU_UMSK       (~(((1U << GLB_REG_GPIO_9_PU_LEN) - 1) << GLB_REG_GPIO_9_PU_POS))
#define GLB_REG_GPIO_9_PD            GLB_REG_GPIO_9_PD
#define GLB_REG_GPIO_9_PD_POS        (21U)
#define GLB_REG_GPIO_9_PD_LEN        (1U)
#define GLB_REG_GPIO_9_PD_MSK        (((1U << GLB_REG_GPIO_9_PD_LEN) - 1) << GLB_REG_GPIO_9_PD_POS)
#define GLB_REG_GPIO_9_PD_UMSK       (~(((1U << GLB_REG_GPIO_9_PD_LEN) - 1) << GLB_REG_GPIO_9_PD_POS))
#define GLB_REG_GPIO_9_FUNC_SEL      GLB_REG_GPIO_9_FUNC_SEL
#define GLB_REG_GPIO_9_FUNC_SEL_POS  (24U)
#define GLB_REG_GPIO_9_FUNC_SEL_LEN  (4U)
#define GLB_REG_GPIO_9_FUNC_SEL_MSK  (((1U << GLB_REG_GPIO_9_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_9_FUNC_SEL_POS)
#define GLB_REG_GPIO_9_FUNC_SEL_UMSK (~(((1U << GLB_REG_GPIO_9_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_9_FUNC_SEL_POS))

