RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/glb_reg.h
/* 0x130 : GPIO_CFGCTL12 */
#define GLB_GPIO_CFGCTL12_OFFSET (0x130)
#define GLB_REG_GPIO_24_IE       GLB_REG_GPIO_24_IE
#define GLB_REG_GPIO_24_IE_POS   (0U)
#define GLB_REG_GPIO_24_IE_LEN   (1U)
#define GLB_REG_GPIO_24_IE_MSK   (((1U << GLB_REG_GPIO_24_IE_LEN) - 1) << GLB_REG_GPIO_24_IE_POS)
#define GLB_REG_GPIO_24_IE_UMSK  (~(((1U << GLB_REG_GPIO_24_IE_LEN) - 1) << GLB_REG_GPIO_24_IE_POS))
#define GLB_REG_GPIO_24_SMT      GLB_REG_GPIO_24_SMT
#define GLB_REG_GPIO_24_SMT_POS  (1U)
#define GLB_REG_GPIO_24_SMT_LEN  (1U)
#define GLB_REG_GPIO_24_SMT_MSK  (((1U << GLB_REG_GPIO_24_SMT_LEN) - 1) << GLB_REG_GPIO_24_SMT_POS)
#define GLB_REG_GPIO_24_SMT_UMSK (~(((1U << GLB_REG_GPIO_24_SMT_LEN) - 1) << GLB_REG_GPIO_24_SMT_POS))
#define GLB_REG_GPIO_24_DRV      GLB_REG_GPIO_24_DRV
#define GLB_REG_GPIO_24_DRV_POS  (2U)
#define GLB_REG_GPIO_24_DRV_LEN  (2U)
#define GLB_REG_GPIO_24_DRV_MSK  (((1U << GLB_REG_GPIO_24_DRV_LEN) - 1) << GLB_REG_GPIO_24_DRV_POS)
#define GLB_REG_GPIO_24_DRV_UMSK (~(((1U << GLB_REG_GPIO_24_DRV_LEN) - 1) << GLB_REG_GPIO_24_DRV_POS))
#define GLB_REG_GPIO_24_PU       GLB_REG_GPIO_24_PU
#define GLB_REG_GPIO_24_PU_POS   (4U)
#define GLB_REG_GPIO_24_PU_LEN   (1U)
#define GLB_REG_GPIO_24_PU_MSK   (((1U << GLB_REG_GPIO_24_PU_LEN) - 1) << GLB_REG_GPIO_24_PU_POS)
#define GLB_REG_GPIO_24_PU_UMSK  (~(((1U << GLB_REG_GPIO_24_PU_LEN) - 1) << GLB_REG_GPIO_24_PU_POS))
#define GLB_REG_GPIO_24_PD       GLB_REG_GPIO_24_PD
#define GLB_REG_GPIO_24_PD_POS   (5U)
#define GLB_REG_GPIO_24_PD_LEN   (1U)
#define GLB_REG_GPIO_24_PD_MSK   (((1U << GLB_REG_GPIO_24_PD_LEN) - 1) << GLB_REG_GPIO_24_PD_POS)
#define GLB_REG_GPIO_24_PD_UMSK  (~(((1U << GLB_REG_GPIO_24_PD_LEN) - 1) << GLB_REG_GPIO_24_PD_POS))
#define GLB_REG_GPIO_25_IE       GLB_REG_GPIO_25_IE
#define GLB_REG_GPIO_25_IE_POS   (16U)
#define GLB_REG_GPIO_25_IE_LEN   (1U)
#define GLB_REG_GPIO_25_IE_MSK   (((1U << GLB_REG_GPIO_25_IE_LEN) - 1) << GLB_REG_GPIO_25_IE_POS)
#define GLB_REG_GPIO_25_IE_UMSK  (~(((1U << GLB_REG_GPIO_25_IE_LEN) - 1) << GLB_REG_GPIO_25_IE_POS))
#define GLB_REG_GPIO_25_SMT      GLB_REG_GPIO_25_SMT
#define GLB_REG_GPIO_25_SMT_POS  (17U)
#define GLB_REG_GPIO_25_SMT_LEN  (1U)
#define GLB_REG_GPIO_25_SMT_MSK  (((1U << GLB_REG_GPIO_25_SMT_LEN) - 1) << GLB_REG_GPIO_25_SMT_POS)
#define GLB_REG_GPIO_25_SMT_UMSK (~(((1U << GLB_REG_GPIO_25_SMT_LEN) - 1) << GLB_REG_GPIO_25_SMT_POS))
#define GLB_REG_GPIO_25_DRV      GLB_REG_GPIO_25_DRV
#define GLB_REG_GPIO_25_DRV_POS  (18U)
#define GLB_REG_GPIO_25_DRV_LEN  (2U)
#define GLB_REG_GPIO_25_DRV_MSK  (((1U << GLB_REG_GPIO_25_DRV_LEN) - 1) << GLB_REG_GPIO_25_DRV_POS)
#define GLB_REG_GPIO_25_DRV_UMSK (~(((1U << GLB_REG_GPIO_25_DRV_LEN) - 1) << GLB_REG_GPIO_25_DRV_POS))
#define GLB_REG_GPIO_25_PU       GLB_REG_GPIO_25_PU
#define GLB_REG_GPIO_25_PU_POS   (20U)
#define GLB_REG_GPIO_25_PU_LEN   (1U)
#define GLB_REG_GPIO_25_PU_MSK   (((1U << GLB_REG_GPIO_25_PU_LEN) - 1) << GLB_REG_GPIO_25_PU_POS)
#define GLB_REG_GPIO_25_PU_UMSK  (~(((1U << GLB_REG_GPIO_25_PU_LEN) - 1) << GLB_REG_GPIO_25_PU_POS))
#define GLB_REG_GPIO_25_PD       GLB_REG_GPIO_25_PD
#define GLB_REG_GPIO_25_PD_POS   (21U)
#define GLB_REG_GPIO_25_PD_LEN   (1U)
#define GLB_REG_GPIO_25_PD_MSK   (((1U << GLB_REG_GPIO_25_PD_LEN) - 1) << GLB_REG_GPIO_25_PD_POS)
#define GLB_REG_GPIO_25_PD_UMSK  (~(((1U << GLB_REG_GPIO_25_PD_LEN) - 1) << GLB_REG_GPIO_25_PD_POS))

/* 0x134 : GPIO_CFGCTL13 */
#define GLB_GPIO_CFGCTL13_OFFSET (0x134)
#define GLB_REG_GPIO_26_IE       GLB_REG_GPIO_26_IE
#define GLB_REG_GPIO_26_IE_POS   (0U)
#define GLB_REG_GPIO_26_IE_LEN   (1U)
#define GLB_REG_GPIO_26_IE_MSK   (((1U << GLB_REG_GPIO_26_IE_LEN) - 1) << GLB_REG_GPIO_26_IE_POS)
#define GLB_REG_GPIO_26_IE_UMSK  (~(((1U << GLB_REG_GPIO_26_IE_LEN) - 1) << GLB_REG_GPIO_26_IE_POS))
#define GLB_REG_GPIO_26_SMT      GLB_REG_GPIO_26_SMT
#define GLB_REG_GPIO_26_SMT_POS  (1U)
#define GLB_REG_GPIO_26_SMT_LEN  (1U)
#define GLB_REG_GPIO_26_SMT_MSK  (((1U << GLB_REG_GPIO_26_SMT_LEN) - 1) << GLB_REG_GPIO_26_SMT_POS)
#define GLB_REG_GPIO_26_SMT_UMSK (~(((1U << GLB_REG_GPIO_26_SMT_LEN) - 1) << GLB_REG_GPIO_26_SMT_POS))
#define GLB_REG_GPIO_26_DRV      GLB_REG_GPIO_26_DRV
#define GLB_REG_GPIO_26_DRV_POS  (2U)
#define GLB_REG_GPIO_26_DRV_LEN  (2U)
#define GLB_REG_GPIO_26_DRV_MSK  (((1U << GLB_REG_GPIO_26_DRV_LEN) - 1) << GLB_REG_GPIO_26_DRV_POS)
#define GLB_REG_GPIO_26_DRV_UMSK (~(((1U << GLB_REG_GPIO_26_DRV_LEN) - 1) << GLB_REG_GPIO_26_DRV_POS))
#define GLB_REG_GPIO_26_PU       GLB_REG_GPIO_26_PU
#define GLB_REG_GPIO_26_PU_POS   (4U)
#define GLB_REG_GPIO_26_PU_LEN   (1U)
#define GLB_REG_GPIO_26_PU_MSK   (((1U << GLB_REG_GPIO_26_PU_LEN) - 1) << GLB_REG_GPIO_26_PU_POS)
#define GLB_REG_GPIO_26_PU_UMSK  (~(((1U << GLB_REG_GPIO_26_PU_LEN) - 1) << GLB_REG_GPIO_26_PU_POS))
#define GLB_REG_GPIO_26_PD       GLB_REG_GPIO_26_PD
#define GLB_REG_GPIO_26_PD_POS   (5U)
#define GLB_REG_GPIO_26_PD_LEN   (1U)
#define GLB_REG_GPIO_26_PD_MSK   (((1U << GLB_REG_GPIO_26_PD_LEN) - 1) << GLB_REG_GPIO_26_PD_POS)
#define GLB_REG_GPIO_26_PD_UMSK  (~(((1U << GLB_REG_GPIO_26_PD_LEN) - 1) << GLB_REG_GPIO_26_PD_POS))
#define GLB_REG_GPIO_27_IE       GLB_REG_GPIO_27_IE
#define GLB_REG_GPIO_27_IE_POS   (16U)
#define GLB_REG_GPIO_27_IE_LEN   (1U)
#define GLB_REG_GPIO_27_IE_MSK   (((1U << GLB_REG_GPIO_27_IE_LEN) - 1) << GLB_REG_GPIO_27_IE_POS)
#define GLB_REG_GPIO_27_IE_UMSK  (~(((1U << GLB_REG_GPIO_27_IE_LEN) - 1) << GLB_REG_GPIO_27_IE_POS))
#define GLB_REG_GPIO_27_SMT      GLB_REG_GPIO_27_SMT
#define GLB_REG_GPIO_27_SMT_POS  (17U)
#define GLB_REG_GPIO_27_SMT_LEN  (1U)
#define GLB_REG_GPIO_27_SMT_MSK  (((1U << GLB_REG_GPIO_27_SMT_LEN) - 1) << GLB_REG_GPIO_27_SMT_POS)
#define GLB_REG_GPIO_27_SMT_UMSK (~(((1U << GLB_REG_GPIO_27_SMT_LEN) - 1) << GLB_REG_GPIO_27_SMT_POS))
#define GLB_REG_GPIO_27_DRV      GLB_REG_GPIO_27_DRV
#define GLB_REG_GPIO_27_DRV_POS  (18U)
#define GLB_REG_GPIO_27_DRV_LEN  (2U)
#define GLB_REG_GPIO_27_DRV_MSK  (((1U << GLB_REG_GPIO_27_DRV_LEN) - 1) << GLB_REG_GPIO_27_DRV_POS)
#define GLB_REG_GPIO_27_DRV_UMSK (~(((1U << GLB_REG_GPIO_27_DRV_LEN) - 1) << GLB_REG_GPIO_27_DRV_POS))
#define GLB_REG_GPIO_27_PU       GLB_REG_GPIO_27_PU
#define GLB_REG_GPIO_27_PU_POS   (20U)
#define GLB_REG_GPIO_27_PU_LEN   (1U)
#define GLB_REG_GPIO_27_PU_MSK   (((1U << GLB_REG_GPIO_27_PU_LEN) - 1) << GLB_REG_GPIO_27_PU_POS)
#define GLB_REG_GPIO_27_PU_UMSK  (~(((1U << GLB_REG_GPIO_27_PU_LEN) - 1) << GLB_REG_GPIO_27_PU_POS))
#define GLB_REG_GPIO_27_PD       GLB_REG_GPIO_27_PD
#define GLB_REG_GPIO_27_PD_POS   (21U)
#define GLB_REG_GPIO_27_PD_LEN   (1U)
#define GLB_REG_GPIO_27_PD_MSK   (((1U << GLB_REG_GPIO_27_PD_LEN) - 1) << GLB_REG_GPIO_27_PD_POS)
#define GLB_REG_GPIO_27_PD_UMSK  (~(((1U << GLB_REG_GPIO_27_PD_LEN) - 1) << GLB_REG_GPIO_27_PD_POS))

/* 0x138 : GPIO_CFGCTL14 */
#define GLB_GPIO_CFGCTL14_OFFSET (0x138)
#define GLB_REG_GPIO_28_IE       GLB_REG_GPIO_28_IE
#define GLB_REG_GPIO_28_IE_POS   (0U)
#define GLB_REG_GPIO_28_IE_LEN   (1U)
#define GLB_REG_GPIO_28_IE_MSK   (((1U << GLB_REG_GPIO_28_IE_LEN) - 1) << GLB_REG_GPIO_28_IE_POS)
#define GLB_REG_GPIO_28_IE_UMSK  (~(((1U << GLB_REG_GPIO_28_IE_LEN) - 1) << GLB_REG_GPIO_28_IE_POS))
#define GLB_REG_GPIO_28_SMT      GLB_REG_GPIO_28_SMT
#define GLB_REG_GPIO_28_SMT_POS  (1U)
#define GLB_REG_GPIO_28_SMT_LEN  (1U)
#define GLB_REG_GPIO_28_SMT_MSK  (((1U << GLB_REG_GPIO_28_SMT_LEN) - 1) << GLB_REG_GPIO_28_SMT_POS)
#define GLB_REG_GPIO_28_SMT_UMSK (~(((1U << GLB_REG_GPIO_28_SMT_LEN) - 1) << GLB_REG_GPIO_28_SMT_POS))
#define GLB_REG_GPIO_28_DRV      GLB_REG_GPIO_28_DRV
#define GLB_REG_GPIO_28_DRV_POS  (2U)
#define GLB_REG_GPIO_28_DRV_LEN  (2U)
#define GLB_REG_GPIO_28_DRV_MSK  (((1U << GLB_REG_GPIO_28_DRV_LEN) - 1) << GLB_REG_GPIO_28_DRV_POS)
#define GLB_REG_GPIO_28_DRV_UMSK (~(((1U << GLB_REG_GPIO_28_DRV_LEN) - 1) << GLB_REG_GPIO_28_DRV_POS))
#define GLB_REG_GPIO_28_PU       GLB_REG_GPIO_28_PU
#define GLB_REG_GPIO_28_PU_POS   (4U)
#define GLB_REG_GPIO_28_PU_LEN   (1U)
#define GLB_REG_GPIO_28_PU_MSK   (((1U << GLB_REG_GPIO_28_PU_LEN) - 1) << GLB_REG_GPIO_28_PU_POS)
#define GLB_REG_GPIO_28_PU_UMSK  (~(((1U << GLB_REG_GPIO_28_PU_LEN) - 1) << GLB_REG_GPIO_28_PU_POS))
#define GLB_REG_GPIO_28_PD       GLB_REG_GPIO_28_PD
#define GLB_REG_GPIO_28_PD_POS   (5U)
#define GLB_REG_GPIO_28_PD_LEN   (1U)
#define GLB_REG_GPIO_28_PD_MSK   (((1U << GLB_REG_GPIO_28_PD_LEN) - 1) << GLB_REG_GPIO_28_PD_POS)
#define GLB_REG_GPIO_28_PD_UMSK  (~(((1U << GLB_REG_GPIO_28_PD_LEN) - 1) << GLB_REG_GPIO_28_PD_POS))

/* 0x180 : GPIO_CFGCTL30 */
#define GLB_GPIO_CFGCTL30_OFFSET (0x180)
#define GLB_REG_GPIO_0_I         GLB_REG_GPIO_0_I
#define GLB_REG_GPIO_0_I_POS     (0U)
#define GLB_REG_GPIO_0_I_LEN     (1U)
#define GLB_REG_GPIO_0_I_MSK     (((1U << GLB_REG_GPIO_0_I_LEN) - 1) << GLB_REG_GPIO_0_I_POS)
#define GLB_REG_GPIO_0_I_UMSK    (~(((1U << GLB_REG_GPIO_0_I_LEN) - 1) << GLB_REG_GPIO_0_I_POS))
#define GLB_REG_GPIO_1_I         GLB_REG_GPIO_1_I
#define GLB_REG_GPIO_1_I_POS     (1U)
#define GLB_REG_GPIO_1_I_LEN     (1U)
#define GLB_REG_GPIO_1_I_MSK     (((1U << GLB_REG_GPIO_1_I_LEN) - 1) << GLB_REG_GPIO_1_I_POS)
#define GLB_REG_GPIO_1_I_UMSK    (~(((1U << GLB_REG_GPIO_1_I_LEN) - 1) << GLB_REG_GPIO_1_I_POS))
#define GLB_REG_GPIO_2_I         GLB_REG_GPIO_2_I
#define GLB_REG_GPIO_2_I_POS     (2U)
#define GLB_REG_GPIO_2_I_LEN     (1U)
#define GLB_REG_GPIO_2_I_MSK     (((1U << GLB_REG_GPIO_2_I_LEN) - 1) << GLB_REG_GPIO_2_I_POS)
#define GLB_REG_GPIO_2_I_UMSK    (~(((1U << GLB_REG_GPIO_2_I_LEN) - 1) << GLB_REG_GPIO_2_I_POS))
#define GLB_REG_GPIO_3_I         GLB_REG_GPIO_3_I
#define GLB_REG_GPIO_3_I_POS     (3U)
#define GLB_REG_GPIO_3_I_LEN     (1U)
#define GLB_REG_GPIO_3_I_MSK     (((1U << GLB_REG_GPIO_3_I_LEN) - 1) << GLB_REG_GPIO_3_I_POS)
#define GLB_REG_GPIO_3_I_UMSK    (~(((1U << GLB_REG_GPIO_3_I_LEN) - 1) << GLB_REG_GPIO_3_I_POS))
#define GLB_REG_GPIO_4_I         GLB_REG_GPIO_4_I
#define GLB_REG_GPIO_4_I_POS     (4U)
#define GLB_REG_GPIO_4_I_LEN     (1U)
#define GLB_REG_GPIO_4_I_MSK     (((1U << GLB_REG_GPIO_4_I_LEN) - 1) << GLB_REG_GPIO_4_I_POS)
#define GLB_REG_GPIO_4_I_UMSK    (~(((1U << GLB_REG_GPIO_4_I_LEN) - 1) << GLB_REG_GPIO_4_I_POS))
#define GLB_REG_GPIO_5_I         GLB_REG_GPIO_5_I
#define GLB_REG_GPIO_5_I_POS     (5U)
#define GLB_REG_GPIO_5_I_LEN     (1U)
#define GLB_REG_GPIO_5_I_MSK     (((1U << GLB_REG_GPIO_5_I_LEN) - 1) << GLB_REG_GPIO_5_I_POS)
#define GLB_REG_GPIO_5_I_UMSK    (~(((1U << GLB_REG_GPIO_5_I_LEN) - 1) << GLB_REG_GPIO_5_I_POS))
#define GLB_REG_GPIO_6_I         GLB_REG_GPIO_6_I
#define GLB_REG_GPIO_6_I_POS     (6U)
#define GLB_REG_GPIO_6_I_LEN     (1U)
#define GLB_REG_GPIO_6_I_MSK     (((1U << GLB_REG_GPIO_6_I_LEN) - 1) << GLB_REG_GPIO_6_I_POS)
#define GLB_REG_GPIO_6_I_UMSK    (~(((1U << GLB_REG_GPIO_6_I_LEN) - 1) << GLB_REG_GPIO_6_I_POS))
#define GLB_REG_GPIO_7_I         GLB_REG_GPIO_7_I
#define GLB_REG_GPIO_7_I_POS     (7U)
#define GLB_REG_GPIO_7_I_LEN     (1U)
#define GLB_REG_GPIO_7_I_MSK     (((1U << GLB_REG_GPIO_7_I_LEN) - 1) << GLB_REG_GPIO_7_I_POS)
#define GLB_REG_GPIO_7_I_UMSK    (~(((1U << GLB_REG_GPIO_7_I_LEN) - 1) << GLB_REG_GPIO_7_I_POS))
#define GLB_REG_GPIO_8_I         GLB_REG_GPIO_8_I
#define GLB_REG_GPIO_8_I_POS     (8U)
#define GLB_REG_GPIO_8_I_LEN     (1U)
#define GLB_REG_GPIO_8_I_MSK     (((1U << GLB_REG_GPIO_8_I_LEN) - 1) << GLB_REG_GPIO_8_I_POS)
#define GLB_REG_GPIO_8_I_UMSK    (~(((1U << GLB_REG_GPIO_8_I_LEN) - 1) << GLB_REG_GPIO_8_I_POS))
#define GLB_REG_GPIO_9_I         GLB_REG_GPIO_9_I
#define GLB_REG_GPIO_9_I_POS     (9U)
#define GLB_REG_GPIO_9_I_LEN     (1U)
#define GLB_REG_GPIO_9_I_MSK     (((1U << GLB_REG_GPIO_9_I_LEN) - 1) << GLB_REG_GPIO_9_I_POS)
#define GLB_REG_GPIO_9_I_UMSK    (~(((1U << GLB_REG_GPIO_9_I_LEN) - 1) << GLB_REG_GPIO_9_I_POS))
#define GLB_REG_GPIO_10_I        GLB_REG_GPIO_10_I
#define GLB_REG_GPIO_10_I_POS    (10U)
#define GLB_REG_GPIO_10_I_LEN    (1U)
#define GLB_REG_GPIO_10_I_MSK    (((1U << GLB_REG_GPIO_10_I_LEN) - 1) << GLB_REG_GPIO_10_I_POS)
#define GLB_REG_GPIO_10_I_UMSK   (~(((1U << GLB_REG_GPIO_10_I_LEN) - 1) << GLB_REG_GPIO_10_I_POS))
#define GLB_REG_GPIO_11_I        GLB_REG_GPIO_11_I
#define GLB_REG_GPIO_11_I_POS    (11U)
#define GLB_REG_GPIO_11_I_LEN    (1U)
#define GLB_REG_GPIO_11_I_MSK    (((1U << GLB_REG_GPIO_11_I_LEN) - 1) << GLB_REG_GPIO_11_I_POS)
#define GLB_REG_GPIO_11_I_UMSK   (~(((1U << GLB_REG_GPIO_11_I_LEN) - 1) << GLB_REG_GPIO_11_I_POS))
#define GLB_REG_GPIO_12_I        GLB_REG_GPIO_12_I
#define GLB_REG_GPIO_12_I_POS    (12U)
#define GLB_REG_GPIO_12_I_LEN    (1U)
#define GLB_REG_GPIO_12_I_MSK    (((1U << GLB_REG_GPIO_12_I_LEN) - 1) << GLB_REG_GPIO_12_I_POS)
#define GLB_REG_GPIO_12_I_UMSK   (~(((1U << GLB_REG_GPIO_12_I_LEN) - 1) << GLB_REG_GPIO_12_I_POS))
#define GLB_REG_GPIO_13_I        GLB_REG_GPIO_13_I
#define GLB_REG_GPIO_13_I_POS    (13U)
#define GLB_REG_GPIO_13_I_LEN    (1U)
#define GLB_REG_GPIO_13_I_MSK    (((1U << GLB_REG_GPIO_13_I_LEN) - 1) << GLB_REG_GPIO_13_I_POS)
#define GLB_REG_GPIO_13_I_UMSK   (~(((1U << GLB_REG_GPIO_13_I_LEN) - 1) << GLB_REG_GPIO_13_I_POS))
#define GLB_REG_GPIO_14_I        GLB_REG_GPIO_14_I
#define GLB_REG_GPIO_14_I_POS    (14U)
#define GLB_REG_GPIO_14_I_LEN    (1U)
#define GLB_REG_GPIO_14_I_MSK    (((1U << GLB_REG_GPIO_14_I_LEN) - 1) << GLB_REG_GPIO_14_I_POS)
#define GLB_REG_GPIO_14_I_UMSK   (~(((1U << GLB_REG_GPIO_14_I_LEN) - 1) << GLB_REG_GPIO_14_I_POS))
#define GLB_REG_GPIO_15_I        GLB_REG_GPIO_15_I
#define GLB_REG_GPIO_15_I_POS    (15U)
#define GLB_REG_GPIO_15_I_LEN    (1U)
#define GLB_REG_GPIO_15_I_MSK    (((1U << GLB_REG_GPIO_15_I_LEN) - 1) << GLB_REG_GPIO_15_I_POS)
#define GLB_REG_GPIO_15_I_UMSK   (~(((1U << GLB_REG_GPIO_15_I_LEN) - 1) << GLB_REG_GPIO_15_I_POS))
#define GLB_REG_GPIO_16_I        GLB_REG_GPIO_16_I
#define GLB_REG_GPIO_16_I_POS    (16U)
#define GLB_REG_GPIO_16_I_LEN    (1U)
#define GLB_REG_GPIO_16_I_MSK    (((1U << GLB_REG_GPIO_16_I_LEN) - 1) << GLB_REG_GPIO_16_I_POS)
#define GLB_REG_GPIO_16_I_UMSK   (~(((1U << GLB_REG_GPIO_16_I_LEN) - 1) << GLB_REG_GPIO_16_I_POS))
#define GLB_REG_GPIO_17_I        GLB_REG_GPIO_17_I
#define GLB_REG_GPIO_17_I_POS    (17U)
#define GLB_REG_GPIO_17_I_LEN    (1U)
#define GLB_REG_GPIO_17_I_MSK    (((1U << GLB_REG_GPIO_17_I_LEN) - 1) << GLB_REG_GPIO_17_I_POS)
#define GLB_REG_GPIO_17_I_UMSK   (~(((1U << GLB_REG_GPIO_17_I_LEN) - 1) << GLB_REG_GPIO_17_I_POS))
#define GLB_REG_GPIO_18_I        GLB_REG_GPIO_18_I
#define GLB_REG_GPIO_18_I_POS    (18U)
#define GLB_REG_GPIO_18_I_LEN    (1U)
#define GLB_REG_GPIO_18_I_MSK    (((1U << GLB_REG_GPIO_18_I_LEN) - 1) << GLB_REG_GPIO_18_I_POS)
#define GLB_REG_GPIO_18_I_UMSK   (~(((1U << GLB_REG_GPIO_18_I_LEN) - 1) << GLB_REG_GPIO_18_I_POS))
#define GLB_REG_GPIO_19_I        GLB_REG_GPIO_19_I
#define GLB_REG_GPIO_19_I_POS    (19U)
#define GLB_REG_GPIO_19_I_LEN    (1U)
#define GLB_REG_GPIO_19_I_MSK    (((1U << GLB_REG_GPIO_19_I_LEN) - 1) << GLB_REG_GPIO_19_I_POS)
#define GLB_REG_GPIO_19_I_UMSK   (~(((1U << GLB_REG_GPIO_19_I_LEN) - 1) << GLB_REG_GPIO_19_I_POS))
#define GLB_REG_GPIO_20_I        GLB_REG_GPIO_20_I
#define GLB_REG_GPIO_20_I_POS    (20U)
#define GLB_REG_GPIO_20_I_LEN    (1U)
#define GLB_REG_GPIO_20_I_MSK    (((1U << GLB_REG_GPIO_20_I_LEN) - 1) << GLB_REG_GPIO_20_I_POS)
#define GLB_REG_GPIO_20_I_UMSK   (~(((1U << GLB_REG_GPIO_20_I_LEN) - 1) << GLB_REG_GPIO_20_I_POS))
#define GLB_REG_GPIO_21_I        GLB_REG_GPIO_21_I
#define GLB_REG_GPIO_21_I_POS    (21U)
#define GLB_REG_GPIO_21_I_LEN    (1U)
#define GLB_REG_GPIO_21_I_MSK    (((1U << GLB_REG_GPIO_21_I_LEN) - 1) << GLB_REG_GPIO_21_I_POS)
#define GLB_REG_GPIO_21_I_UMSK   (~(((1U << GLB_REG_GPIO_21_I_LEN) - 1) << GLB_REG_GPIO_21_I_POS))
#define GLB_REG_GPIO_22_I        GLB_REG_GPIO_22_I
#define GLB_REG_GPIO_22_I_POS    (22U)
#define GLB_REG_GPIO_22_I_LEN    (1U)
#define GLB_REG_GPIO_22_I_MSK    (((1U << GLB_REG_GPIO_22_I_LEN) - 1) << GLB_REG_GPIO_22_I_POS)
#define GLB_REG_GPIO_22_I_UMSK   (~(((1U << GLB_REG_GPIO_22_I_LEN) - 1) << GLB_REG_GPIO_22_I_POS))

/* 0x184 : GPIO_CFGCTL31 */
#define GLB_GPIO_CFGCTL31_OFFSET (0x184)

/* 0x188 : GPIO_CFGCTL32 */
#define GLB_GPIO_CFGCTL32_OFFSET (0x188)
#define GLB_REG_GPIO_0_O         GLB_REG_GPIO_0_O
#define GLB_REG_GPIO_0_O_POS     (0U)
#define GLB_REG_GPIO_0_O_LEN     (1U)
#define GLB_REG_GPIO_0_O_MSK     (((1U << GLB_REG_GPIO_0_O_LEN) - 1) << GLB_REG_GPIO_0_O_POS)
#define GLB_REG_GPIO_0_O_UMSK    (~(((1U << GLB_REG_GPIO_0_O_LEN) - 1) << GLB_REG_GPIO_0_O_POS))
#define GLB_REG_GPIO_1_O         GLB_REG_GPIO_1_O
#define GLB_REG_GPIO_1_O_POS     (1U)
#define GLB_REG_GPIO_1_O_LEN     (1U)
#define GLB_REG_GPIO_1_O_MSK     (((1U << GLB_REG_GPIO_1_O_LEN) - 1) << GLB_REG_GPIO_1_O_POS)
#define GLB_REG_GPIO_1_O_UMSK    (~(((1U << GLB_REG_GPIO_1_O_LEN) - 1) << GLB_REG_GPIO_1_O_POS))
#define GLB_REG_GPIO_2_O         GLB_REG_GPIO_2_O
#define GLB_REG_GPIO_2_O_POS     (2U)
#define GLB_REG_GPIO_2_O_LEN     (1U)
#define GLB_REG_GPIO_2_O_MSK     (((1U << GLB_REG_GPIO_2_O_LEN) - 1) << GLB_REG_GPIO_2_O_POS)
#define GLB_REG_GPIO_2_O_UMSK    (~(((1U << GLB_REG_GPIO_2_O_LEN) - 1) << GLB_REG_GPIO_2_O_POS))
#define GLB_REG_GPIO_3_O         GLB_REG_GPIO_3_O
#define GLB_REG_GPIO_3_O_POS     (3U)
#define GLB_REG_GPIO_3_O_LEN     (1U)
#define GLB_REG_GPIO_3_O_MSK     (((1U << GLB_REG_GPIO_3_O_LEN) - 1) << GLB_REG_GPIO_3_O_POS)
#define GLB_REG_GPIO_3_O_UMSK    (~(((1U << GLB_REG_GPIO_3_O_LEN) - 1) << GLB_REG_GPIO_3_O_POS))
#define GLB_REG_GPIO_4_O         GLB_REG_GPIO_4_O
#define GLB_REG_GPIO_4_O_POS     (4U)
#define GLB_REG_GPIO_4_O_LEN     (1U)
#define GLB_REG_GPIO_4_O_MSK     (((1U << GLB_REG_GPIO_4_O_LEN) - 1) << GLB_REG_GPIO_4_O_POS)
#define GLB_REG_GPIO_4_O_UMSK    (~(((1U << GLB_REG_GPIO_4_O_LEN) - 1) << GLB_REG_GPIO_4_O_POS))
#define GLB_REG_GPIO_5_O         GLB_REG_GPIO_5_O
#define GLB_REG_GPIO_5_O_POS     (5U)
#define GLB_REG_GPIO_5_O_LEN     (1U)
#define GLB_REG_GPIO_5_O_MSK     (((1U << GLB_REG_GPIO_5_O_LEN) - 1) << GLB_REG_GPIO_5_O_POS)
#define GLB_REG_GPIO_5_O_UMSK    (~(((1U << GLB_REG_GPIO_5_O_LEN) - 1) << GLB_REG_GPIO_5_O_POS))
#define GLB_REG_GPIO_6_O         GLB_REG_GPIO_6_O
#define GLB_REG_GPIO_6_O_POS     (6U)
#define GLB_REG_GPIO_6_O_LEN     (1U)
#define GLB_REG_GPIO_6_O_MSK     (((1U << GLB_REG_GPIO_6_O_LEN) - 1) << GLB_REG_GPIO_6_O_POS)
#define GLB_REG_GPIO_6_O_UMSK    (~(((1U << GLB_REG_GPIO_6_O_LEN) - 1) << GLB_REG_GPIO_6_O_POS))
#define GLB_REG_GPIO_7_O         GLB_REG_GPIO_7_O
#define GLB_REG_GPIO_7_O_POS     (7U)
#define GLB_REG_GPIO_7_O_LEN     (1U)
#define GLB_REG_GPIO_7_O_MSK     (((1U << GLB_REG_GPIO_7_O_LEN) - 1) << GLB_REG_GPIO_7_O_POS)
#define GLB_REG_GPIO_7_O_UMSK    (~(((1U << GLB_REG_GPIO_7_O_LEN) - 1) << GLB_REG_GPIO_7_O_POS))
#define GLB_REG_GPIO_8_O         GLB_REG_GPIO_8_O
#define GLB_REG_GPIO_8_O_POS     (8U)
#define GLB_REG_GPIO_8_O_LEN     (1U)
#define GLB_REG_GPIO_8_O_MSK     (((1U << GLB_REG_GPIO_8_O_LEN) - 1) << GLB_REG_GPIO_8_O_POS)
#define GLB_REG_GPIO_8_O_UMSK    (~(((1U << GLB_REG_GPIO_8_O_LEN) - 1) << GLB_REG_GPIO_8_O_POS))
#define GLB_REG_GPIO_9_O         GLB_REG_GPIO_9_O
#define GLB_REG_GPIO_9_O_POS     (9U)
#define GLB_REG_GPIO_9_O_LEN     (1U)
#define GLB_REG_GPIO_9_O_MSK     (((1U << GLB_REG_GPIO_9_O_LEN) - 1) << GLB_REG_GPIO_9_O_POS)
#define GLB_REG_GPIO_9_O_UMSK    (~(((1U << GLB_REG_GPIO_9_O_LEN) - 1) << GLB_REG_GPIO_9_O_POS))
#define GLB_REG_GPIO_10_O        GLB_REG_GPIO_10_O
#define GLB_REG_GPIO_10_O_POS    (10U)
#define GLB_REG_GPIO_10_O_LEN    (1U)
#define GLB_REG_GPIO_10_O_MSK    (((1U << GLB_REG_GPIO_10_O_LEN) - 1) << GLB_REG_GPIO_10_O_POS)
#define GLB_REG_GPIO_10_O_UMSK   (~(((1U << GLB_REG_GPIO_10_O_LEN) - 1) << GLB_REG_GPIO_10_O_POS))
#define GLB_REG_GPIO_11_O        GLB_REG_GPIO_11_O
#define GLB_REG_GPIO_11_O_POS    (11U)
#define GLB_REG_GPIO_11_O_LEN    (1U)
#define GLB_REG_GPIO_11_O_MSK    (((1U << GLB_REG_GPIO_11_O_LEN) - 1) << GLB_REG_GPIO_11_O_POS)
#define GLB_REG_GPIO_11_O_UMSK   (~(((1U << GLB_REG_GPIO_11_O_LEN) - 1) << GLB_REG_GPIO_11_O_POS))
#define GLB_REG_GPIO_12_O        GLB_REG_GPIO_12_O
#define GLB_REG_GPIO_12_O_POS    (12U)
#define GLB_REG_GPIO_12_O_LEN    (1U)
#define GLB_REG_GPIO_12_O_MSK    (((1U << GLB_REG_GPIO_12_O_LEN) - 1) << GLB_REG_GPIO_12_O_POS)
#define GLB_REG_GPIO_12_O_UMSK   (~(((1U << GLB_REG_GPIO_12_O_LEN) - 1) << GLB_REG_GPIO_12_O_POS))
#define GLB_REG_GPIO_13_O        GLB_REG_GPIO_13_O
#define GLB_REG_GPIO_13_O_POS    (13U)
#define GLB_REG_GPIO_13_O_LEN    (1U)
#define GLB_REG_GPIO_13_O_MSK    (((1U << GLB_REG_GPIO_13_O_LEN) - 1) << GLB_REG_GPIO_13_O_POS)
#define GLB_REG_GPIO_13_O_UMSK   (~(((1U << GLB_REG_GPIO_13_O_LEN) - 1) << GLB_REG_GPIO_13_O_POS))
#define GLB_REG_GPIO_14_O        GLB_REG_GPIO_14_O
#define GLB_REG_GPIO_14_O_POS    (14U)
#define GLB_REG_GPIO_14_O_LEN    (1U)
#define GLB_REG_GPIO_14_O_MSK    (((1U << GLB_REG_GPIO_14_O_LEN) - 1) << GLB_REG_GPIO_14_O_POS)
#define GLB_REG_GPIO_14_O_UMSK   (~(((1U << GLB_REG_GPIO_14_O_LEN) - 1) << GLB_REG_GPIO_14_O_POS))
#define GLB_REG_GPIO_15_O        GLB_REG_GPIO_15_O
#define GLB_REG_GPIO_15_O_POS    (15U)
#define GLB_REG_GPIO_15_O_LEN    (1U)
#define GLB_REG_GPIO_15_O_MSK    (((1U << GLB_REG_GPIO_15_O_LEN) - 1) << GLB_REG_GPIO_15_O_POS)
#define GLB_REG_GPIO_15_O_UMSK   (~(((1U << GLB_REG_GPIO_15_O_LEN) - 1) << GLB_REG_GPIO_15_O_POS))
#define GLB_REG_GPIO_16_O        GLB_REG_GPIO_16_O
#define GLB_REG_GPIO_16_O_POS    (16U)
#define GLB_REG_GPIO_16_O_LEN    (1U)
#define GLB_REG_GPIO_16_O_MSK    (((1U << GLB_REG_GPIO_16_O_LEN) - 1) << GLB_REG_GPIO_16_O_POS)
#define GLB_REG_GPIO_16_O_UMSK   (~(((1U << GLB_REG_GPIO_16_O_LEN) - 1) << GLB_REG_GPIO_16_O_POS))
#define GLB_REG_GPIO_17_O        GLB_REG_GPIO_17_O
#define GLB_REG_GPIO_17_O_POS    (17U)
#define GLB_REG_GPIO_17_O_LEN    (1U)
#define GLB_REG_GPIO_17_O_MSK    (((1U << GLB_REG_GPIO_17_O_LEN) - 1) << GLB_REG_GPIO_17_O_POS)
#define GLB_REG_GPIO_17_O_UMSK   (~(((1U << GLB_REG_GPIO_17_O_LEN) - 1) << GLB_REG_GPIO_17_O_POS))
#define GLB_REG_GPIO_18_O        GLB_REG_GPIO_18_O
#define GLB_REG_GPIO_18_O_POS    (18U)
#define GLB_REG_GPIO_18_O_LEN    (1U)
#define GLB_REG_GPIO_18_O_MSK    (((1U << GLB_REG_GPIO_18_O_LEN) - 1) << GLB_REG_GPIO_18_O_POS)
#define GLB_REG_GPIO_18_O_UMSK   (~(((1U << GLB_REG_GPIO_18_O_LEN) - 1) << GLB_REG_GPIO_18_O_POS))
#define GLB_REG_GPIO_19_O        GLB_REG_GPIO_19_O
#define GLB_REG_GPIO_19_O_POS    (19U)
#define GLB_REG_GPIO_19_O_LEN    (1U)
#define GLB_REG_GPIO_19_O_MSK    (((1U << GLB_REG_GPIO_19_O_LEN) - 1) << GLB_REG_GPIO_19_O_POS)
#define GLB_REG_GPIO_19_O_UMSK   (~(((1U << GLB_REG_GPIO_19_O_LEN) - 1) << GLB_REG_GPIO_19_O_POS))
#define GLB_REG_GPIO_20_O        GLB_REG_GPIO_20_O
#define GLB_REG_GPIO_20_O_POS    (20U)
#define GLB_REG_GPIO_20_O_LEN    (1U)
#define GLB_REG_GPIO_20_O_MSK    (((1U << GLB_REG_GPIO_20_O_LEN) - 1) << GLB_REG_GPIO_20_O_POS)
#define GLB_REG_GPIO_20_O_UMSK   (~(((1U << GLB_REG_GPIO_20_O_LEN) - 1) << GLB_REG_GPIO_20_O_POS))
#define GLB_REG_GPIO_21_O        GLB_REG_GPIO_21_O
#define GLB_REG_GPIO_21_O_POS    (21U)
#define GLB_REG_GPIO_21_O_LEN    (1U)
#define GLB_REG_GPIO_21_O_MSK    (((1U << GLB_REG_GPIO_21_O_LEN) - 1) << GLB_REG_GPIO_21_O_POS)
#define GLB_REG_GPIO_21_O_UMSK   (~(((1U << GLB_REG_GPIO_21_O_LEN) - 1) << GLB_REG_GPIO_21_O_POS))
#define GLB_REG_GPIO_22_O        GLB_REG_GPIO_22_O
#define GLB_REG_GPIO_22_O_POS    (22U)
#define GLB_REG_GPIO_22_O_LEN    (1U)
#define GLB_REG_GPIO_22_O_MSK    (((1U << GLB_REG_GPIO_22_O_LEN) - 1) << GLB_REG_GPIO_22_O_POS)
#define GLB_REG_GPIO_22_O_UMSK   (~(((1U << GLB_REG_GPIO_22_O_LEN) - 1) << GLB_REG_GPIO_22_O_POS))

/* 0x18C : GPIO_CFGCTL33 */
#define GLB_GPIO_CFGCTL33_OFFSET (0x18C)

