RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/glb_reg.h
    /* 0x8 : clk_cfg2 */
    union {
        struct
        {
            uint32_t uart_clk_div     : 3; /* [ 2: 0],        r/w,        0x7 */
            uint32_t reserved_3       : 1; /* [    3],       rsvd,        0x0 */
            uint32_t uart_clk_en      : 1; /* [    4],        r/w,        0x1 */
            uint32_t reserved_5_6     : 2; /* [ 6: 5],       rsvd,        0x0 */
            uint32_t hbn_uart_clk_sel : 1; /* [    7],          r,        0x0 */
            uint32_t sf_clk_div       : 3; /* [10: 8],        r/w,        0x3 */
            uint32_t sf_clk_en        : 1; /* [   11],        r/w,        0x1 */
            uint32_t sf_clk_sel       : 2; /* [13:12],        r/w,        0x2 */
            uint32_t sf_clk_sel2      : 2; /* [15:14],        r/w,        0x0 */
            uint32_t ir_clk_div       : 6; /* [21:16],        r/w,        0xf */
            uint32_t reserved_22      : 1; /* [   22],       rsvd,        0x0 */
            uint32_t ir_clk_en        : 1; /* [   23],        r/w,        0x1 */
            uint32_t dma_clk_en       : 8; /* [31:24],        r/w,       0xff */
        } BF;
        uint32_t WORD;
    } clk_cfg2;

    /* 0xC : clk_cfg3 */
    union {
        struct
        {
            uint32_t spi_clk_div    : 5; /* [ 4: 0],        r/w,        0x3 */
            uint32_t reserved_5_7   : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t spi_clk_en     : 1; /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_15  : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t i2c_clk_div    : 8; /* [23:16],        r/w,       0xff */
            uint32_t i2c_clk_en     : 1; /* [   24],        r/w,        0x1 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clk_cfg3;

    /* 0x10 : swrst_cfg0 */
    union {
        struct
        {
            uint32_t swrst_s00     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t swrst_s01     : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_3  : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t swrst_s20     : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7  : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t swrst_s30     : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_31 : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } swrst_cfg0;

    /* 0x14 : swrst_cfg1 */
    union {
        struct
        {
            uint32_t swrst_s10      : 1; /* [    0],        r/w,        0x0 */
            uint32_t swrst_s11      : 1; /* [    1],        r/w,        0x0 */
            uint32_t swrst_s12      : 1; /* [    2],        r/w,        0x0 */
            uint32_t swrst_s13      : 1; /* [    3],        r/w,        0x0 */
            uint32_t swrst_s14      : 1; /* [    4],        r/w,        0x0 */
            uint32_t swrst_s15      : 1; /* [    5],        r/w,        0x0 */
            uint32_t swrst_s16      : 1; /* [    6],        r/w,        0x0 */
            uint32_t swrst_s17      : 1; /* [    7],        r/w,        0x0 */
            uint32_t swrst_s18      : 1; /* [    8],        r/w,        0x0 */
            uint32_t swrst_s19      : 1; /* [    9],        r/w,        0x0 */
            uint32_t swrst_s1a      : 1; /* [   10],        r/w,        0x0 */
            uint32_t swrst_s1b      : 1; /* [   11],        r/w,        0x0 */
            uint32_t swrst_s1c      : 1; /* [   12],        r/w,        0x0 */
            uint32_t swrst_s1d      : 1; /* [   13],        r/w,        0x0 */
            uint32_t swrst_s1e      : 1; /* [   14],        r/w,        0x0 */
            uint32_t swrst_s1f      : 1; /* [   15],        r/w,        0x0 */
            uint32_t swrst_s1a0     : 1; /* [   16],        r/w,        0x0 */
            uint32_t swrst_s1a1     : 1; /* [   17],        r/w,        0x0 */
            uint32_t swrst_s1a2     : 1; /* [   18],        r/w,        0x0 */
            uint32_t swrst_s1a3     : 1; /* [   19],        r/w,        0x0 */
            uint32_t swrst_s1a4     : 1; /* [   20],        r/w,        0x0 */
            uint32_t swrst_s1a5     : 1; /* [   21],        r/w,        0x0 */
            uint32_t swrst_s1a6     : 1; /* [   22],        r/w,        0x0 */
            uint32_t swrst_s1a7     : 1; /* [   23],        r/w,        0x0 */
            uint32_t reserved_24_31 : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } swrst_cfg1;

    /* 0x18 : swrst_cfg2 */
    union {
        struct
        {
            uint32_t reg_ctrl_pwron_rst   : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_ctrl_cpu_reset   : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reg_ctrl_sys_reset   : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3           : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t reg_ctrl_reset_dummy : 4;  /* [ 7: 4],        r/w,        0x0 */
            uint32_t reserved_8_23        : 16; /* [23: 8],       rsvd,        0x0 */
            uint32_t pka_clk_sel          : 1;  /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_31       : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } swrst_cfg2;

    /* 0x1C : swrst_cfg3 */
    union {
        struct
        {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } swrst_cfg3;

    /* 0x20 : cgen_cfg0 */
    union {
        struct
        {
            uint32_t cgen_m        : 8;  /* [ 7: 0],        r/w,       0xff */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cgen_cfg0;

    /* 0x24 : cgen_cfg1 */
    union {
        struct
        {
            uint32_t cgen_s1        : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t cgen_s1a       : 8;  /* [23:16],        r/w,       0xff */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cgen_cfg1;

    /* 0x28 : cgen_cfg2 */
    union {
        struct
        {
            uint32_t cgen_s2       : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_3  : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t cgen_s3       : 1;  /* [    4],        r/w,        0x1 */
            uint32_t reserved_5_31 : 27; /* [31: 5],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cgen_cfg2;

    /* 0x2C : cgen_cfg3 */
    union {
        struct
        {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cgen_cfg3;

    /* 0x30 : MBIST_CTL */
    union {
        struct
        {
            uint32_t irom_mbist_mode  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t hsram_mbist_mode : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tag_mbist_mode   : 1;  /* [    2],        r/w,        0x0 */
            uint32_t ocram_mbist_mode : 1;  /* [    3],        r/w,        0x0 */
            uint32_t wifi_mbist_mode  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_30    : 26; /* [30: 5],       rsvd,        0x0 */
            uint32_t reg_mbist_rst_n  : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } MBIST_CTL;

    /* 0x34 : MBIST_STAT */
    union {
        struct
        {
            uint32_t irom_mbist_done  : 1;  /* [    0],          r,        0x0 */
            uint32_t hsram_mbist_done : 1;  /* [    1],          r,        0x0 */
            uint32_t tag_mbist_done   : 1;  /* [    2],          r,        0x0 */
            uint32_t ocram_mbist_done : 1;  /* [    3],          r,        0x0 */
            uint32_t wifi_mbist_done  : 1;  /* [    4],          r,        0x0 */
            uint32_t reserved_5_15    : 11; /* [15: 5],       rsvd,        0x0 */
            uint32_t irom_mbist_fail  : 1;  /* [   16],          r,        0x0 */
            uint32_t hsram_mbist_fail : 1;  /* [   17],          r,        0x0 */
            uint32_t tag_mbist_fail   : 1;  /* [   18],          r,        0x0 */
            uint32_t ocram_mbist_fail : 1;  /* [   19],          r,        0x0 */
            uint32_t wifi_mbist_fail  : 1;  /* [   20],          r,        0x0 */
            uint32_t reserved_21_31   : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } MBIST_STAT;

    /* 0x38  reserved */
    uint8_t RESERVED0x38[24];

    /* 0x50 : bmx_cfg1 */
    union {
        struct
        {
            uint32_t bmx_timeout_en      : 4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t bmx_arb_mode        : 2; /* [ 5: 4],        r/w,        0x0 */
            uint32_t reserved_6_7        : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t bmx_err_en          : 1; /* [    8],        r/w,        0x0 */
            uint32_t bmx_busy_option_dis : 1; /* [    9],        r/w,        0x0 */
            uint32_t bmx_gating_dis      : 1; /* [   10],        r/w,        0x0 */
            uint32_t reserved_11         : 1; /* [   11],       rsvd,        0x0 */
            uint32_t hsel_option         : 4; /* [15:12],        r/w,        0x0 */
            uint32_t pds_apb_cfg         : 8; /* [23:16],        r/w,        0x0 */
            uint32_t hbn_apb_cfg         : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg1;

