RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/glb_reg.h
    /* 0x100 : GPIO_CFGCTL0 */
    union {
        struct
        {
            uint32_t reg_gpio_0_ie        : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_0_smt       : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_0_drv       : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_0_pu        : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_0_pd        : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_0_func_sel  : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t real_gpio_0_func_sel : 4; /* [15:12],          r,        0x1 */
            uint32_t reg_gpio_1_ie        : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_1_smt       : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_1_drv       : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_1_pu        : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_1_pd        : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_1_func_sel  : 4; /* [27:24],        r/w,        0x1 */
            uint32_t real_gpio_1_func_sel : 4; /* [31:28],          r,        0x1 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL0;

    /* 0x104 : GPIO_CFGCTL1 */
    union {
        struct
        {
            uint32_t reg_gpio_2_ie        : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_2_smt       : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_2_drv       : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_2_pu        : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_2_pd        : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_2_func_sel  : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t real_gpio_2_func_sel : 4; /* [15:12],          r,        0x1 */
            uint32_t reg_gpio_3_ie        : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_3_smt       : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_3_drv       : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_3_pu        : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_3_pd        : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_3_func_sel  : 4; /* [27:24],        r/w,        0x1 */
            uint32_t real_gpio_3_func_sel : 4; /* [31:28],          r,        0x1 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL1;

    /* 0x108 : GPIO_CFGCTL2 */
    union {
        struct
        {
            uint32_t reg_gpio_4_ie        : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_4_smt       : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_4_drv       : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_4_pu        : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_4_pd        : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_4_func_sel  : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t real_gpio_4_func_sel : 4; /* [15:12],          r,        0x1 */
            uint32_t reg_gpio_5_ie        : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_5_smt       : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_5_drv       : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_5_pu        : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_5_pd        : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_5_func_sel  : 4; /* [27:24],        r/w,        0x1 */
            uint32_t real_gpio_5_func_sel : 4; /* [31:28],          r,        0x1 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL2;

    /* 0x10C : GPIO_CFGCTL3 */
    union {
        struct
        {
            uint32_t reg_gpio_6_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_6_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_6_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_6_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_6_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7        : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_6_func_sel : 4; /* [11: 8],        r/w,        0xb */
            uint32_t reserved_12_15      : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_gpio_7_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_7_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_7_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_7_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_7_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23      : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_7_func_sel : 4; /* [27:24],        r/w,        0xb */
            uint32_t reserved_28_31      : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL3;

    /* 0x110 : GPIO_CFGCTL4 */
    union {
        struct
        {
            uint32_t reg_gpio_8_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_8_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_8_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_8_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_8_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7        : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_8_func_sel : 4; /* [11: 8],        r/w,        0xb */
            uint32_t reserved_12_15      : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_gpio_9_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_9_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_9_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_9_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_9_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23      : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_9_func_sel : 4; /* [27:24],        r/w,        0xb */
            uint32_t reserved_28_31      : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL4;

    /* 0x114 : GPIO_CFGCTL5 */
    union {
        struct
        {
            uint32_t reg_gpio_10_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_10_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_10_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_10_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_10_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_10_func_sel : 4; /* [11: 8],        r/w,        0xb */
            uint32_t reserved_12_15       : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_gpio_11_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_11_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_11_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_11_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_11_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_11_func_sel : 4; /* [27:24],        r/w,        0xe */
            uint32_t reserved_28_31       : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL5;

    /* 0x118 : GPIO_CFGCTL6 */
    union {
        struct
        {
            uint32_t reg_gpio_12_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_12_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_12_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_12_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_12_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_12_func_sel : 4; /* [11: 8],        r/w,        0xe */
            uint32_t reserved_12_15       : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_gpio_13_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_13_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_13_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_13_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_13_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_13_func_sel : 4; /* [27:24],        r/w,        0xb */
            uint32_t reserved_28_31       : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL6;

