RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/glb_reg.h
    /* 0x11C : GPIO_CFGCTL7 */
    union {
        struct
        {
            uint32_t reg_gpio_14_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_14_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_14_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_14_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_14_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_14_func_sel : 4; /* [11: 8],        r/w,        0xe */
            uint32_t reserved_12_15       : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_gpio_15_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_15_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_15_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_15_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_15_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_15_func_sel : 4; /* [27:24],        r/w,        0xb */
            uint32_t reserved_28_31       : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL7;

    /* 0x120 : GPIO_CFGCTL8 */
    union {
        struct
        {
            uint32_t reg_gpio_16_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_16_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_16_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_16_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_16_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_16_func_sel : 4; /* [11: 8],        r/w,        0xb */
            uint32_t reserved_12_15       : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_gpio_17_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_17_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_17_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_17_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_17_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_17_func_sel : 4; /* [27:24],        r/w,        0xe */
            uint32_t reserved_28_31       : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL8;

    /* 0x124 : GPIO_CFGCTL9 */
    union {
        struct
        {
            uint32_t reg_gpio_18_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_18_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_18_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_18_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_18_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_18_func_sel : 4; /* [11: 8],        r/w,        0xb */
            uint32_t reserved_12_15       : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_gpio_19_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_19_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_19_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_19_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_19_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_19_func_sel : 4; /* [27:24],        r/w,        0xb */
            uint32_t reserved_28_31       : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL9;

    /* 0x128 : GPIO_CFGCTL10 */
    union {
        struct
        {
            uint32_t reg_gpio_20_ie       : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_20_smt      : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_20_drv      : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_20_pu       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_20_pd       : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_20_func_sel : 4; /* [11: 8],        r/w,        0xb */
            uint32_t reserved_12_15       : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_gpio_21_ie       : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_21_smt      : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_21_drv      : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_21_pu       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_21_pd       : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_21_func_sel : 4; /* [27:24],        r/w,        0xb */
            uint32_t reserved_28_31       : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL10;

    /* 0x12C : GPIO_CFGCTL11 */
    union {
        struct
        {
            uint32_t reg_gpio_22_ie       : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_22_smt      : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_22_drv      : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_22_pu       : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_22_pd       : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_22_func_sel : 4;  /* [11: 8],        r/w,        0xb */
            uint32_t reserved_12_15       : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_gpio_23_ie       : 1;  /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_23_smt      : 1;  /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_23_drv      : 2;  /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_23_pu       : 1;  /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_23_pd       : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31       : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL11;

