RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/glb_reg.h
    /* 0x1ac  reserved */
    uint8_t RESERVED0x1ac[4];

    /* 0x1B0 : GPIO_INT_CLR1 */
    union {
        struct
        {
            uint32_t reg_gpio_int_clr1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT_CLR1;

    /* 0x1b4  reserved */
    uint8_t RESERVED0x1b4[12];

    /* 0x1C0 : GPIO_INT_MODE_SET1 */
    union {
        struct
        {
            uint32_t reg_gpio_int_mode_set1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT_MODE_SET1;

    /* 0x1C4 : GPIO_INT_MODE_SET2 */
    union {
        struct
        {
            uint32_t reg_gpio_int_mode_set2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT_MODE_SET2;

    /* 0x1C8 : GPIO_INT_MODE_SET3 */
    union {
        struct
        {
            uint32_t reg_gpio_int_mode_set3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } GPIO_INT_MODE_SET3;

    /* 0x1cc  reserved */
    uint8_t RESERVED0x1cc[88];

    /* 0x224 : led_driver */
    union {
        struct
        {
            uint32_t led_din_reg          : 1;  /* [    0],        r/w,        0x0 */
            uint32_t led_din_sel          : 1;  /* [    1],        r/w,        0x0 */
            uint32_t led_din_polarity_sel : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3           : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t leddrv_ibias         : 4;  /* [ 7: 4],        r/w,        0x8 */
            uint32_t ir_rx_gpio_sel       : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_30       : 21; /* [30:10],       rsvd,        0x0 */
            uint32_t pu_leddrv            : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } led_driver;

    /* 0x228  reserved */
    uint8_t RESERVED0x228[224];

    /* 0x308 : gpdac_ctrl */
    union {
        struct
        {
            uint32_t gpdaca_rstn_ana : 1;  /* [    0],        r/w,        0x1 */
            uint32_t gpdacb_rstn_ana : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reserved_2_6    : 5;  /* [ 6: 2],       rsvd,        0x0 */
            uint32_t gpdac_test_en   : 1;  /* [    7],        r/w,        0x0 */
            uint32_t gpdac_ref_sel   : 1;  /* [    8],        r/w,        0x0 */
            uint32_t gpdac_test_sel  : 3;  /* [11: 9],        r/w,        0x0 */
            uint32_t reserved_12_23  : 12; /* [23:12],       rsvd,        0x0 */
            uint32_t gpdac_reserved  : 8;  /* [31:24],        r/w,        0xf */
        } BF;
        uint32_t WORD;
    } gpdac_ctrl;

    /* 0x30C : gpdac_actrl */
    union {
        struct
        {
            uint32_t gpdac_a_en     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t gpdac_ioa_en   : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_17  : 16; /* [17: 2],       rsvd,        0x0 */
            uint32_t gpdac_a_rng    : 2;  /* [19:18],        r/w,        0x3 */
            uint32_t gpdac_a_outmux : 3;  /* [22:20],        r/w,        0x0 */
            uint32_t reserved_23_31 : 9;  /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpdac_actrl;

    /* 0x310 : gpdac_bctrl */
    union {
        struct
        {
            uint32_t gpdac_b_en     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t gpdac_iob_en   : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_17  : 16; /* [17: 2],       rsvd,        0x0 */
            uint32_t gpdac_b_rng    : 2;  /* [19:18],        r/w,        0x3 */
            uint32_t gpdac_b_outmux : 3;  /* [22:20],        r/w,        0x0 */
            uint32_t reserved_23_31 : 9;  /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpdac_bctrl;

    /* 0x314 : gpdac_data */
    union {
        struct
        {
            uint32_t gpdac_b_data   : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t gpdac_a_data   : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpdac_data;

    /* 0x318  reserved */
    uint8_t RESERVED0x318[3048];

    /* 0xF00 : tzc_glb_ctrl_0 */
    union {
        struct
        {
            uint32_t tzc_glb_swrst_s00_lock       : 1; /* [    0],          r,        0x0 */
            uint32_t tzc_glb_swrst_s01_lock       : 1; /* [    1],          r,        0x0 */
            uint32_t reserved_2_7                 : 6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t tzc_glb_swrst_s30_lock       : 1; /* [    8],          r,        0x0 */
            uint32_t reserved_9_11                : 3; /* [11: 9],       rsvd,        0x0 */
            uint32_t tzc_glb_ctrl_pwron_rst_lock  : 1; /* [   12],          r,        0x0 */
            uint32_t tzc_glb_ctrl_cpu_reset_lock  : 1; /* [   13],          r,        0x0 */
            uint32_t tzc_glb_ctrl_sys_reset_lock  : 1; /* [   14],          r,        0x0 */
            uint32_t tzc_glb_ctrl_ungated_ap_lock : 1; /* [   15],          r,        0x0 */
            uint32_t reserved_16_24               : 9; /* [24:16],       rsvd,        0x0 */
            uint32_t tzc_glb_misc_lock            : 1; /* [   25],          r,        0x0 */
            uint32_t tzc_glb_sram_lock            : 1; /* [   26],          r,        0x0 */
            uint32_t tzc_glb_l2c_lock             : 1; /* [   27],          r,        0x0 */
            uint32_t tzc_glb_bmx_lock             : 1; /* [   28],          r,        0x0 */
            uint32_t tzc_glb_dbg_lock             : 1; /* [   29],          r,        0x0 */
            uint32_t tzc_glb_mbist_lock           : 1; /* [   30],          r,        0x0 */
            uint32_t tzc_glb_clk_lock             : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_glb_ctrl_0;

    /* 0xF04 : tzc_glb_ctrl_1 */
    union {
        struct
        {
            uint32_t tzc_glb_swrst_s20_lock : 1; /* [    0],          r,        0x0 */
            uint32_t tzc_glb_swrst_s21_lock : 1; /* [    1],          r,        0x0 */
            uint32_t tzc_glb_swrst_s22_lock : 1; /* [    2],          r,        0x0 */
            uint32_t tzc_glb_swrst_s23_lock : 1; /* [    3],          r,        0x0 */
            uint32_t tzc_glb_swrst_s24_lock : 1; /* [    4],          r,        0x0 */
            uint32_t tzc_glb_swrst_s25_lock : 1; /* [    5],          r,        0x0 */
            uint32_t tzc_glb_swrst_s26_lock : 1; /* [    6],          r,        0x0 */
            uint32_t tzc_glb_swrst_s27_lock : 1; /* [    7],          r,        0x0 */
            uint32_t tzc_glb_swrst_s28_lock : 1; /* [    8],          r,        0x0 */
            uint32_t tzc_glb_swrst_s29_lock : 1; /* [    9],          r,        0x0 */
            uint32_t tzc_glb_swrst_s2a_lock : 1; /* [   10],          r,        0x0 */
            uint32_t tzc_glb_swrst_s2b_lock : 1; /* [   11],          r,        0x0 */
            uint32_t tzc_glb_swrst_s2c_lock : 1; /* [   12],          r,        0x0 */
            uint32_t tzc_glb_swrst_s2d_lock : 1; /* [   13],          r,        0x0 */
            uint32_t tzc_glb_swrst_s2e_lock : 1; /* [   14],          r,        0x0 */
            uint32_t tzc_glb_swrst_s2f_lock : 1; /* [   15],          r,        0x0 */
            uint32_t tzc_glb_swrst_s10_lock : 1; /* [   16],          r,        0x0 */
            uint32_t tzc_glb_swrst_s11_lock : 1; /* [   17],          r,        0x0 */
            uint32_t tzc_glb_swrst_s12_lock : 1; /* [   18],          r,        0x0 */
            uint32_t tzc_glb_swrst_s13_lock : 1; /* [   19],          r,        0x0 */
            uint32_t tzc_glb_swrst_s14_lock : 1; /* [   20],          r,        0x0 */
            uint32_t tzc_glb_swrst_s15_lock : 1; /* [   21],          r,        0x0 */
            uint32_t tzc_glb_swrst_s16_lock : 1; /* [   22],          r,        0x0 */
            uint32_t tzc_glb_swrst_s17_lock : 1; /* [   23],          r,        0x0 */
            uint32_t tzc_glb_swrst_s18_lock : 1; /* [   24],          r,        0x0 */
            uint32_t tzc_glb_swrst_s19_lock : 1; /* [   25],          r,        0x0 */
            uint32_t tzc_glb_swrst_s1a_lock : 1; /* [   26],          r,        0x0 */
            uint32_t tzc_glb_swrst_s1b_lock : 1; /* [   27],          r,        0x0 */
            uint32_t tzc_glb_swrst_s1c_lock : 1; /* [   28],          r,        0x0 */
            uint32_t tzc_glb_swrst_s1d_lock : 1; /* [   29],          r,        0x0 */
            uint32_t tzc_glb_swrst_s1e_lock : 1; /* [   30],          r,        0x0 */
            uint32_t tzc_glb_swrst_s1f_lock : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_glb_ctrl_1;

    /* 0xF08 : tzc_glb_ctrl_2 */
    union {
        struct
        {
            uint32_t tzc_glb_gpio_0_lock  : 1; /* [    0],          r,        0x0 */
            uint32_t tzc_glb_gpio_1_lock  : 1; /* [    1],          r,        0x0 */
            uint32_t tzc_glb_gpio_2_lock  : 1; /* [    2],          r,        0x0 */
            uint32_t tzc_glb_gpio_3_lock  : 1; /* [    3],          r,        0x0 */
            uint32_t tzc_glb_gpio_4_lock  : 1; /* [    4],          r,        0x0 */
            uint32_t tzc_glb_gpio_5_lock  : 1; /* [    5],          r,        0x0 */
            uint32_t tzc_glb_gpio_6_lock  : 1; /* [    6],          r,        0x0 */
            uint32_t tzc_glb_gpio_7_lock  : 1; /* [    7],          r,        0x0 */
            uint32_t tzc_glb_gpio_8_lock  : 1; /* [    8],          r,        0x0 */
            uint32_t tzc_glb_gpio_9_lock  : 1; /* [    9],          r,        0x0 */
            uint32_t tzc_glb_gpio_10_lock : 1; /* [   10],          r,        0x0 */
            uint32_t tzc_glb_gpio_11_lock : 1; /* [   11],          r,        0x0 */
            uint32_t tzc_glb_gpio_12_lock : 1; /* [   12],          r,        0x0 */
            uint32_t tzc_glb_gpio_13_lock : 1; /* [   13],          r,        0x0 */
            uint32_t tzc_glb_gpio_14_lock : 1; /* [   14],          r,        0x0 */
            uint32_t tzc_glb_gpio_15_lock : 1; /* [   15],          r,        0x0 */
            uint32_t tzc_glb_gpio_16_lock : 1; /* [   16],          r,        0x0 */
            uint32_t tzc_glb_gpio_17_lock : 1; /* [   17],          r,        0x0 */
            uint32_t tzc_glb_gpio_18_lock : 1; /* [   18],          r,        0x0 */
            uint32_t tzc_glb_gpio_19_lock : 1; /* [   19],          r,        0x0 */
            uint32_t tzc_glb_gpio_20_lock : 1; /* [   20],          r,        0x0 */
            uint32_t tzc_glb_gpio_21_lock : 1; /* [   21],          r,        0x0 */
            uint32_t tzc_glb_gpio_22_lock : 1; /* [   22],          r,        0x0 */
            uint32_t tzc_glb_gpio_23_lock : 1; /* [   23],          r,        0x0 */
            uint32_t tzc_glb_gpio_24_lock : 1; /* [   24],          r,        0x0 */
            uint32_t tzc_glb_gpio_25_lock : 1; /* [   25],          r,        0x0 */
            uint32_t tzc_glb_gpio_26_lock : 1; /* [   26],          r,        0x0 */
            uint32_t tzc_glb_gpio_27_lock : 1; /* [   27],          r,        0x0 */
            uint32_t tzc_glb_gpio_28_lock : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29_31       : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_glb_ctrl_2;

    /* 0xF0C : tzc_glb_ctrl_3 */
    union {
        struct
        {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_glb_ctrl_3;
};

typedef volatile struct glb_reg glb_reg_t;

/*Following is reg patch*/

/* 0x0 : GPIO_CFGCTL */
#define GLB_GPIO_CFGCTL_OFFSET        (0x0)
#define GLB_REG_GPIO_0_IE             GLB_REG_GPIO_0_IE
#define GLB_REG_GPIO_0_IE_POS         (0U)
#define GLB_REG_GPIO_0_IE_LEN         (1U)
#define GLB_REG_GPIO_0_IE_MSK         (((1U << GLB_REG_GPIO_0_IE_LEN) - 1) << GLB_REG_GPIO_0_IE_POS)
#define GLB_REG_GPIO_0_IE_UMSK        (~(((1U << GLB_REG_GPIO_0_IE_LEN) - 1) << GLB_REG_GPIO_0_IE_POS))
#define GLB_REG_GPIO_0_SMT            GLB_REG_GPIO_0_SMT
#define GLB_REG_GPIO_0_SMT_POS        (1U)
#define GLB_REG_GPIO_0_SMT_LEN        (1U)
#define GLB_REG_GPIO_0_SMT_MSK        (((1U << GLB_REG_GPIO_0_SMT_LEN) - 1) << GLB_REG_GPIO_0_SMT_POS)
#define GLB_REG_GPIO_0_SMT_UMSK       (~(((1U << GLB_REG_GPIO_0_SMT_LEN) - 1) << GLB_REG_GPIO_0_SMT_POS))
#define GLB_REG_GPIO_0_DRV            GLB_REG_GPIO_0_DRV
#define GLB_REG_GPIO_0_DRV_POS        (2U)
#define GLB_REG_GPIO_0_DRV_LEN        (2U)
#define GLB_REG_GPIO_0_DRV_MSK        (((1U << GLB_REG_GPIO_0_DRV_LEN) - 1) << GLB_REG_GPIO_0_DRV_POS)
#define GLB_REG_GPIO_0_DRV_UMSK       (~(((1U << GLB_REG_GPIO_0_DRV_LEN) - 1) << GLB_REG_GPIO_0_DRV_POS))
#define GLB_REG_GPIO_0_PU             GLB_REG_GPIO_0_PU
#define GLB_REG_GPIO_0_PU_POS         (4U)
#define GLB_REG_GPIO_0_PU_LEN         (1U)
#define GLB_REG_GPIO_0_PU_MSK         (((1U << GLB_REG_GPIO_0_PU_LEN) - 1) << GLB_REG_GPIO_0_PU_POS)
#define GLB_REG_GPIO_0_PU_UMSK        (~(((1U << GLB_REG_GPIO_0_PU_LEN) - 1) << GLB_REG_GPIO_0_PU_POS))
#define GLB_REG_GPIO_0_PD             GLB_REG_GPIO_0_PD
#define GLB_REG_GPIO_0_PD_POS         (5U)
#define GLB_REG_GPIO_0_PD_LEN         (1U)
#define GLB_REG_GPIO_0_PD_MSK         (((1U << GLB_REG_GPIO_0_PD_LEN) - 1) << GLB_REG_GPIO_0_PD_POS)
#define GLB_REG_GPIO_0_PD_UMSK        (~(((1U << GLB_REG_GPIO_0_PD_LEN) - 1) << GLB_REG_GPIO_0_PD_POS))
#define GLB_REG_GPIO_0_FUNC_SEL       GLB_REG_GPIO_0_FUNC_SEL
#define GLB_REG_GPIO_0_FUNC_SEL_POS   (8U)
#define GLB_REG_GPIO_0_FUNC_SEL_LEN   (4U)
#define GLB_REG_GPIO_0_FUNC_SEL_MSK   (((1U << GLB_REG_GPIO_0_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_0_FUNC_SEL_POS)
#define GLB_REG_GPIO_0_FUNC_SEL_UMSK  (~(((1U << GLB_REG_GPIO_0_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_0_FUNC_SEL_POS))
#define GLB_REAL_GPIO_0_FUNC_SEL      GLB_REAL_GPIO_0_FUNC_SEL
#define GLB_REAL_GPIO_0_FUNC_SEL_POS  (12U)
#define GLB_REAL_GPIO_0_FUNC_SEL_LEN  (4U)
#define GLB_REAL_GPIO_0_FUNC_SEL_MSK  (((1U << GLB_REAL_GPIO_0_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_0_FUNC_SEL_POS)
#define GLB_REAL_GPIO_0_FUNC_SEL_UMSK (~(((1U << GLB_REAL_GPIO_0_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_0_FUNC_SEL_POS))
#define GLB_REG_GPIO_1_IE             GLB_REG_GPIO_1_IE
#define GLB_REG_GPIO_1_IE_POS         (16U)
#define GLB_REG_GPIO_1_IE_LEN         (1U)
#define GLB_REG_GPIO_1_IE_MSK         (((1U << GLB_REG_GPIO_1_IE_LEN) - 1) << GLB_REG_GPIO_1_IE_POS)
#define GLB_REG_GPIO_1_IE_UMSK        (~(((1U << GLB_REG_GPIO_1_IE_LEN) - 1) << GLB_REG_GPIO_1_IE_POS))
#define GLB_REG_GPIO_1_SMT            GLB_REG_GPIO_1_SMT
#define GLB_REG_GPIO_1_SMT_POS        (17U)
#define GLB_REG_GPIO_1_SMT_LEN        (1U)
#define GLB_REG_GPIO_1_SMT_MSK        (((1U << GLB_REG_GPIO_1_SMT_LEN) - 1) << GLB_REG_GPIO_1_SMT_POS)
#define GLB_REG_GPIO_1_SMT_UMSK       (~(((1U << GLB_REG_GPIO_1_SMT_LEN) - 1) << GLB_REG_GPIO_1_SMT_POS))
#define GLB_REG_GPIO_1_DRV            GLB_REG_GPIO_1_DRV
#define GLB_REG_GPIO_1_DRV_POS        (18U)
#define GLB_REG_GPIO_1_DRV_LEN        (2U)
#define GLB_REG_GPIO_1_DRV_MSK        (((1U << GLB_REG_GPIO_1_DRV_LEN) - 1) << GLB_REG_GPIO_1_DRV_POS)
#define GLB_REG_GPIO_1_DRV_UMSK       (~(((1U << GLB_REG_GPIO_1_DRV_LEN) - 1) << GLB_REG_GPIO_1_DRV_POS))
#define GLB_REG_GPIO_1_PU             GLB_REG_GPIO_1_PU
#define GLB_REG_GPIO_1_PU_POS         (20U)
#define GLB_REG_GPIO_1_PU_LEN         (1U)
#define GLB_REG_GPIO_1_PU_MSK         (((1U << GLB_REG_GPIO_1_PU_LEN) - 1) << GLB_REG_GPIO_1_PU_POS)
#define GLB_REG_GPIO_1_PU_UMSK        (~(((1U << GLB_REG_GPIO_1_PU_LEN) - 1) << GLB_REG_GPIO_1_PU_POS))
#define GLB_REG_GPIO_1_PD             GLB_REG_GPIO_1_PD
#define GLB_REG_GPIO_1_PD_POS         (21U)
#define GLB_REG_GPIO_1_PD_LEN         (1U)
#define GLB_REG_GPIO_1_PD_MSK         (((1U << GLB_REG_GPIO_1_PD_LEN) - 1) << GLB_REG_GPIO_1_PD_POS)
#define GLB_REG_GPIO_1_PD_UMSK        (~(((1U << GLB_REG_GPIO_1_PD_LEN) - 1) << GLB_REG_GPIO_1_PD_POS))
#define GLB_REG_GPIO_1_FUNC_SEL       GLB_REG_GPIO_1_FUNC_SEL
#define GLB_REG_GPIO_1_FUNC_SEL_POS   (24U)
#define GLB_REG_GPIO_1_FUNC_SEL_LEN   (4U)
#define GLB_REG_GPIO_1_FUNC_SEL_MSK   (((1U << GLB_REG_GPIO_1_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_1_FUNC_SEL_POS)
#define GLB_REG_GPIO_1_FUNC_SEL_UMSK  (~(((1U << GLB_REG_GPIO_1_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_1_FUNC_SEL_POS))
#define GLB_REAL_GPIO_1_FUNC_SEL      GLB_REAL_GPIO_1_FUNC_SEL
#define GLB_REAL_GPIO_1_FUNC_SEL_POS  (28U)
#define GLB_REAL_GPIO_1_FUNC_SEL_LEN  (4U)
#define GLB_REAL_GPIO_1_FUNC_SEL_MSK  (((1U << GLB_REAL_GPIO_1_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_1_FUNC_SEL_POS)
#define GLB_REAL_GPIO_1_FUNC_SEL_UMSK (~(((1U << GLB_REAL_GPIO_1_FUNC_SEL_LEN) - 1) << GLB_REAL_GPIO_1_FUNC_SEL_POS))

