RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/glb_reg.h
struct glb_gpio_reg {
    /* 0x0 : GPIO_CFGCTL */
    union {
        struct
        {
            uint32_t reg_gpio_0_ie        : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_0_smt       : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_0_drv       : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_0_pu        : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_0_pd        : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_gpio_0_func_sel  : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t real_gpio_0_func_sel : 4; /* [15:12],          r,        0x1 */
            uint32_t reg_gpio_1_ie        : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio_1_smt       : 1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio_1_drv       : 2; /* [19:18],        r/w,        0x0 */
            uint32_t reg_gpio_1_pu        : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_gpio_1_pd        : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_gpio_1_func_sel  : 4; /* [27:24],        r/w,        0x1 */
            uint32_t real_gpio_1_func_sel : 4; /* [31:28],          r,        0x1 */
        } BF;
        uint32_t WORD;
    } GPIO_CFGCTL;
};

typedef volatile struct glb_gpio_reg glb_gpio_reg_t;

#define GLB_GPIO_OFFSET           0x100
#define GLB_GPIO_INPUT_OFFSET     0x180
#define GLB_GPIO_OUTPUT_OFFSET    0x188
#define GLB_GPIO_OUTPUT_EN_OFFSET 0x190

#endif /* __GLB_REG_H__ */
